its-lit.org
#+title: John's Emacs Configuration
#+subtitle: And scattered esoterica to help my future self
#+author: John Sperger
#+language: en
#+options: toc:2
#+startup: show2levels
#+startup: num
# macros taken from prot's config https://git.sr.ht/~protesilaos/dotfiles
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last revised and exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*
* Detailed Outline
:PROPERTIES:
:TOC:      :include all :depth 4
:CUSTOM_ID: detailed-outline
:LAST_MODIFIED: [2025-07-20 Sun 20:49]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
:CONTENTS:
- [[#detailed-outline][Detailed Outline]]
- [[#overview][Overview]]
  - [[#style][Style]]
  - [[#design-decisions--notable-features][Design Decisions & Notable Features]]
    - [[#support-for-detangling-excluding-headerfooter][Support for detangling (excluding header/footer)]]
    - [[#aggressive-time-stamping][Aggressive time-stamping]]
  - [[#warnings][Warnings]]
    - [[#i-have-no-idea-what-im-doing][I have no idea what I'm doing]]
    - [[#i-dont-care-about-startup-time-or-at-least-dont-optimize-for-it][I don't care about startup time (or at least don't optimize for it)]]
  - [[#lisp-helpers-for-maintaining-my-literate-config][Lisp helpers for maintaining my literate config]]
- [[#notes-on-configuring-emacs][Notes on configuring Emacs]]
  - [[#things-i-found-or-continue-to-find-particularly-confusing][Things I found or continue to find particularly confusing]]
    - [[#package-management-and-loading-packages][Package management and loading packages]]
    - [[#the-right-way-to-configure-package-options][The "right" way to configure package options]]
  - [[#notes-while-figuring-out-how-to-make-header-and-footer-templates][Notes while figuring out how to make header and footer templates]]
    - [[#potentially-useful][Potentially useful]]
      - [[#noweb-syntax][noweb syntax]]
      - [[#hooks][hooks]]
      - [[#functions][functions]]
    - [[#related-examples-from-the-internet][Related examples from the internet]]
      - [[#use-noweb-functionality-to-include-variable-values-in-tangled-files][Use :noweb functionality to include variable values in tangled files]]
      - [[#lisp-in-header-argument-for-conditional-evaluation][lisp in header argument for conditional evaluation]]
      - [[#tangling-with-variables][Tangling with variables]]
      - [[#eric-schultes-org-scraps][Eric Schulte's org scraps]]
- [[#emacs-user-directory-files-init-and-early-init][Emacs user directory files (init and early-init)]]
  - [[#early-init][Early init]]
    - [[#optimizations-for-early-init][Optimizations for early-init]]
    - [[#disable-package-initialization-for-elpaca][Disable package initialization for elpaca]]
    - [[#configure-gui-elements][Configure GUI elements]]
    - [[#disable-byte-compilation-warnings][Disable byte compilation warnings]]
    - [[#early-init-footer][early-init footer]]
  - [[#initel][init.el]]
    - [[#bootstrap-elpaca-package-manager][Bootstrap Elpaca package manager]]
    - [[#define-constants-to-use-as-conditional-configuration-flags][Define constants to use as conditional configuration flags]]
    - [[#declare-packages-that-are-immediately-loaded][Declare packages that are immediately loaded]]
      - [[#no-littering][no-littering]]
      - [[#general-for-keybinds][General for keybinds]]
      - [[#benchmark-init-time][Benchmark init time]]
    - [[#load-configuration-files][Load configuration files]]
    - [[#load-custom-file-and-run-after-init-hooks][Load custom file and run after-init hooks]]
    - [[#local-variable-footer-for-init][Local variable footer for init]]
- [[#config-directory-for-non-byte-compiled-files][Config directory for non-byte-compiled files]]
  - [[#one-stop-keybinding-shop][One stop keybinding shop]]
    - [[#keyboard-macros][Keyboard macros]]
    - [[#global-key-binds][Global key binds]]
      - [[#removed-keybindings][Removed keybindings]]
      - [[#mac-specific-keybinds][Mac-specific keybinds]]
    - [[#keybind-file-footer][Keybind file footer]]
  - [[#configure-base-emacs-options-and-built-in-packages][Configure base Emacs options and built-in packages]]
    - [[#base-and-built-in-file-header][Base and built-in file header]]
    - [[#configure-base-emacs-options][Configure base emacs options]]
      - [[#currently-unused-base-configuration][Currently unused base configuration]]
    - [[#configuring-built-in-packages][Configuring built-in packages]]
      - [[#removed-built-in-configuration][Removed built-in configuration]]
    - [[#configure-built-in-programming-utilities][Configure built-in programming utilities]]
    - [[#configure-ediff-for-viewing-diffs][Configure ediff for viewing diffs]]
    - [[#outline-mode-configuration][Outline mode configuration]]
    - [[#treesitter][Treesitter]]
      - [[#inactive-treesitter][Inactive treesitter]]
    - [[#built-in-package-configuration-that-were-in-a-separate-file-for-some-reason][Built-in package configuration that were in a separate file for some reason]]
    - [[#which-key-configuration][which-key configuration]]
    - [[#base-and-built-in-configuration-footer][Base and built-in configuration footer]]
  - [[#editor-utilities-and-core-functionality][Editor utilities and "core" functionality]]
    - [[#configure-editor-utility-packages][Configure editor utility packages]]
      - [[#utilities-for-interact-with-the-operating-system][Utilities for interact with the operating system]]
      - [[#scratch-buffer-utilities][Scratch buffer utilities]]
      - [[#search-utilities][Search utilities]]
      - [[#terminal-configuration][Terminal configuration]]
    - [[#data-format-modes][Data format modes]]
      - [[#removed-data-viewers][Removed data viewers]]
    - [[#modify-core-editor-functioning][Modify core editor functioning]]
      - [[#smooth-scrolling][Smooth scrolling]]
      - [[#setup-help-and-documentation-viewers][Setup help and documentation viewers]]
      - [[#configuring-how-undo-works][Configuring how undo works]]
      - [[#windowing][Windowing]]
    - [[#outline-and-fold-text][Outline and fold text]]
    - [[#spell-check-with-jinx][Spell check with jinx]]
    - [[#text-snippet-insertion-and-collections][Text snippet insertion and collections]]
      - [[#removed-snippet-packages-and-customization][Removed snippet packages and customization]]
    - [[#text-editing-non-evil][Text editing (non-evil)]]
    - [[#footer-for-utilities-config][Footer for utilities config]]
    - [[#removed-packages][Removed packages]]
  - [[#configure-all-things-org-mode][Configure all things org mode]]
    - [[#configure-org-header][Configure org header]]
    - [[#configure-base-org-settings-and-major-mode-keybinds][Configure base org settings and major mode keybinds]]
    - [[#configure-org-functionality-add-ons][Configure org functionality add-ons]]
      - [[#disabled-org-functionality-packages][Disabled org functionality packages]]
    - [[#configure-org-modes-progeny][Configure org mode's progeny]]
      - [[#org-todoist][org-todoist]]
      - [[#configure-org-node][Configure Org-node]]
    - [[#configure-additional-org-exporters][Configure additional org exporters]]
    - [[#configuring-org-capture-templates][Configuring org capture templates]]
    - [[#add-additional-ways-to-export-from-org-to-other-formats][Add additional ways to export from org to other formats]]
      - [[#disabled-exporters][Disabled Exporters]]
    - [[#configure-org-footer][Configure org footer]]
  - [[#configure-programming-language-specific-modes-and-options][Configure (programming) language-specific modes and options]]
    - [[#lisp-like-languages][Lisp-like languages]]
    - [[#python-configuration][Python configuration]]
      - [[#disabled-python-packages][Disabled python packages]]
    - [[#r-programming][R programming]]
      - [[#keymap-references-for-ess][Keymap references for ess]]
      - [[#disabled-r-packages][Disabled R packages]]
    - [[#rust-programming][Rust programming]]
    - [[#programming-languages-footer][Programming languages footer]]
  - [[#configure-theming][Configure theming]]
    - [[#preserve-appearance-of-collapsed-outline-headings-until-window-edge][Preserve appearance of collapsed outline headings until window edge]]
    - [[#color-theme-packages][Color theme packages]]
      - [[#disabled-themes][Disabled themes]]
    - [[#managing-fonts][Managing fonts]]
      - [[#view-fonts-within-emacs][View fonts within emacs]]
      - [[#disabled-packages][Disabled packages]]
    - [[#theming-advice-and-hooks][Theming advice and hooks]]
    - [[#theming-lisp-footer][Theming lisp footer]]
  - [[#configure-completion-frameworks][Configure completion frameworks]]
    - [[#setup-completion-actionsel][setup-completion-actions.el]]
    - [[#set-up-completion-backends][Set up completion backends]]
      - [[#other-completion-backends][Other completion backends]]
    - [[#annotate-completion-options][Annotate completion options]]
    - [[#setup-completionel][setup-completion.el]]
    - [[#setup-consultel][setup-consult.el]]
  - [[#setup-denoteel][setup-denote.el]]
  - [[#setup-diagrammingel][setup-diagramming.el]]
  - [[#setup-eafel][setup-eaf.el]]
  - [[#setup-emacsel][setup-emacs.el]]
  - [[#setup-emailel][setup-email.el]]
  - [[#setup-evil-addonsel][setup-evil-addons.el]]
  - [[#setup-evilel][setup-evil.el]]
  - [[#setup-font-lockingel][setup-font-locking.el]]
  - [[#setup-goel][setup-go.el]]
  - [[#setup-gopherel][setup-gopher.el]]
  - [[#setup-iconsel][setup-icons.el]]
  - [[#setup-llmel][setup-llm.el]]
    - [[#llm-unused-config][LLM unused config]]
  - [[#configure-programming-tools-language-agnostic-or-multi-language][Configure programming tools (language agnostic or multi-language)]]
    - [[#language-server-lsp-bridge][Language server (lsp-bridge)]]
      - [[#lsp-bridge-command-reference][Lsp Bridge Command reference]]
    - [[#unicode-input][Unicode input]]
    - [[#code-formatting][Code formatting]]
      - [[#removed-code-formatters][Removed code formatters]]
    - [[#footer-for-configure-programming-tools][Footer for configure programming tools]]
  - [[#setup-lspel][setup-lsp.el]]
  - [[#setup-mediael][setup-media.el]]
  - [[#setup-modelineel][setup-modeline.el]]
  - [[#setup-notesel][setup-notes.el]]
  - [[#setup-projectsel][setup-projects.el]]
  - [[#setup-readingel][setup-reading.el]]
    - [[#fix-pdf-tools-post-build-command][Fix pdf-tools post-build command]]
    - [[#reading-package-declarations][Reading package declarations]]
    - [[#removed-reading-packages][Removed reading packages]]
  - [[#setup-uiel][setup-ui.el]]
    - [[#removed-elements][Removed elements]]
      - [[#focus-mode-type-packages][Focus mode type packages]]
      - [[#minibuffer][Minibuffer]]
      - [[#window-automatic-sizing-and-window-configuration-management][Window automatic sizing and window configuration management]]
      - [[#programming-focused-ui-changes][Programming focused UI changes]]
      - [[#probably-theming-not-ui][Probably theming not UI]]
  - [[#setup-vcel][setup-vc.el]]
  - [[#setup-webel][setup-web.el]]
  - [[#writing-in-emacs][Writing in emacs]]
    - [[#organizing-writing-projects][Organizing writing projects]]
    - [[#writing-major-modes][Writing major modes]]
      - [[#markdown-mode][Markdown mode]]
      - [[#latex--tex-configuration][LaTeX / TeX configuration]]
    - [[#bibliography-management][Bibliography management]]
      - [[#old-config][Old config]]
    - [[#writing-footer][Writing footer]]
  - [[#setup-writingel][setup-writing.el]]
- [[#lisp-functions][Lisp functions]]
  - [[#my-core-functionsel][my-core-functions.el]]
  - [[#my-core-helpersel][my-core-helpers.el]]
  - [[#my-editor-helpersel][my-editor-helpers.el]]
  - [[#my-keybinding-helpersel][my-keybinding-helpers.el]]
  - [[#my-lang-helpersel][my-lang-helpers.el]]
  - [[#my-lsp-bridge-helpersel][my-lsp-bridge-helpers.el]]
  - [[#my-org-helpersel][my-org-helpers.el]]
  - [[#my-theme-helpersel][my-theme-helpers.el]]
  - [[#my-vc-helpersel][my-vc-helpers.el]]
- [[#appendices][Appendices]]
  - [[#local-variables][Local Variables]]
:END:


* Overview
:PROPERTIES:
:LAST_MODIFIED: [2025-07-16 Wed 00:42]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:TOC:  :include siblings :force (nothing) :ignore (nothing) :local (nothing) :depth 2
:CUSTOM_ID: overview
:END:

This file documents and generates my Emacs configuration. It tangles to create
my configuration files; this is distinct from the kind of literate config that
uses the org file as the config file.

** Style
:PROPERTIES:
:CUSTOM_ID: style
:LAST_MODIFIED: [2025-07-19 Sat 19:10]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Headings in the sections containing configuration code are functional as well as
organizational. 
#+name: Heading structure
| Level   | Usage                                                |
|---------+------------------------------------------------------|
| H1 ~*~    | Organization; Tangle to distinct directories         |
| H2 ~**~   | Each header at this level tangles to a distinct file |
| H3+ ~***~ | Finer-grained control of time stamping, header args  |
|         |                                                      |

** Design Decisions & Notable Features
:PROPERTIES:
:CUSTOM_ID: design-decisions--notable-features
:END:
*** Support for detangling (excluding header/footer)
:PROPERTIES:
:CUSTOM_ID: support-for-detangling-excluding-headerfooter
:LAST_MODIFIED: [2025-07-19 Sat 19:15]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

The header option =:comments noweb= encases the code in the tangled file with a
comment linking back to the org source block. This enables detangling; you can
edit elisp files and backpropogate the changes to this org file. Not sure if this will be a good idea or if it's just an invitation for the config to get out of sync.

**** Headers and footers
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:32]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Detangling relies on magic comments that are inserted in the tangled file to
link them back to a src block in the org file. The contents of the src block get
encased by comment lines (automatically adjusted to the language of the block)
like:

#+begin_src emacs-lisp :eval no results: asis :noweb no
;; [[file:its-lit.org::{src block}][{src block}]]
...
;; {src block} ends here
#+end_src

This presents a problem for the header of lisp files with a lexical binding
directive:
#+begin_src emacs-lisp :eval no results: asis :noweb no
-*- lexical-binding: t -*-
#+end_src

I spent a bit of time trying to automagically add these but ultimately gave up
for now. The workaround is very simple, manual header and footer blocks with
=:comments no= added to the header arugments:

#+name: Example header
#+begin_src org
,#+begin_src emacs-lisp :comments no
;;; {file}.el --- short description -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:
,#+end_src
#+end_src

#+name: Example footer
#+begin_src org
,#+begin_src emacs-lisp :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-{file} ends here
,#+end_src
#+end_src

Because they're so boiler plate I wanted to write a function that would print
them automatically based on the tangle destination + a user-supplied argument
for the short description. 
A simple solution with just the directive and no other info would be easiest with a post-tangle hook, but I want more functionality like including the filename and short description in the first line. Maybe someday, but for now just need to be disciplined about editing the org file not the indvidual lisp files. Maybe someday... [[#notes-header-and-footer-templates][maybe someday
]]
