its-lit.org
*** Aggressive time-stamping
:PROPERTIES:
:CUSTOM_ID: aggressive-time-stamping
:LAST_MODIFIED: [2025-07-19 Sat 19:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
The combination of scavenging snippets from a multitude of dotfiles, tending
towards maximalism in package usage, Emacs's long history and ongoing
development, and starting to configure Emacs before I had any idea what I was
doing combine to make certain configuration options obsolete over time.

You'll encounter snippets that have been passed around since time immemorial
(the early-init garbage collector trick is a notable one that still seems to
have utility even if it's just saving fractions of a second).

** Warnings
:PROPERTIES:
:CUSTOM_ID: warnings
:END:
*** I have no idea what I'm doing
:PROPERTIES:
:CUSTOM_ID: i-have-no-idea-what-im-doing
:END:
*** I don't care about startup time (or at least don't optimize for it)
:PROPERTIES:
:CUSTOM_ID: i-dont-care-about-startup-time-or-at-least-dont-optimize-for-it
:END:
This config is meant to be used with Emacs running as a daemon. When I want to
open Emacs I'm really calling ~emacsclient~ with an option to create a new frame.
When I "quit" emacs I just delete the current frame. The initialization is far
from optimized because I only have to wait for it if I'm debugging some part of
my configuration. 

I'm sympathetic to the arguments in this blog post that [[https://batsov.com/articles/2025/04/07/emacs-startup-time-does-not-matter/][start-up time doesn't matter]] (to me). 

** Lisp helpers for maintaining my literate config
:PROPERTIES:
:header-args: :tangle no
:CUSTOM_ID: lisp-helpers-for-maintaining-my-literate-config
:LAST_MODIFIED: [2025-07-31 Thu 17:16]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Work in progress

* Notes on configuring Emacs
:PROPERTIES:
:CUSTOM_ID: notes-on-configuring-emacs
:END:
** Things I found or continue to find particularly confusing
:PROPERTIES:
:CUSTOM_ID: things-i-found-or-continue-to-find-particularly-confusing
:END:
*** Package management and loading packages
:PROPERTIES:
:CUSTOM_ID: package-management-and-loading-packages
:END:
related: 
*** The "right" way to configure package options
:PROPERTIES:
:CUSTOM_ID: the-right-way-to-configure-package-options
:END:
** Notes while figuring out how to make header and footer templates
:PROPERTIES:
:CUSTOM_ID: notes-while-figuring-out-how-to-make-header-and-footer-templates
:END:
*** Potentially useful
:PROPERTIES:
:CUSTOM_ID: potentially-useful
:END:
**** noweb syntax
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 01:06]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: noweb-syntax
:END:
=< <code-block-name> >= (no spaces between brackets, just a rendering workaround) Insert the literal body of code block code-block-name itself.

=< <code-block-name()> >=: Insert the *results of evaluating the code block code-block-name (as obtained with org-babel-execute-src-block). That can be of different types: LaTeX, etc.

=< <code-block-name(x = 3.3)> >=: Insert the results of evaluating it with the specified argument value.

Note that you can customize org-babel-noweb-wrap-start and org-babel-noweb-wrap-end to use something else than angle brackets (for example, double quotes).

/Problem:/ doesn't seem to be suitable for passing an argument in a variable that's defined in the header or in a property due to the order things are evaluated but I'm not super confident about that. 
**** hooks
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 00:57]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: hooks
:END:
- =org-babel-post-tangle-hook= which is run within tangled code files "making it suitable for post-processing, compilation, and evaluation of code in the tangled files."

[[https://emacs.stackexchange.com/questions/81540/lexical-binding-in-a-tangled-init-el-file][stack overflow example using this to add lexical binding directive]]

#+begin_src emacs-lisp :tangle no :eval no
;; function
(defun my-ensure-lexical-binding-cookie()
  (goto-char(point-min)) ;; beginning of tangled code
  (insert ";; -*- coding: utf-8; lexical-binding: t -*-")
  (newline)
  (newline)
  (let ((inhibit-message t)) ;; Don't show messages from these functions
    (basic-save-buffer)
    (kill-buffer) nil)

 ;; Adding the hook
(add-hook 'org-babel-post-tangle-hook #'my-ensure-lexical-binding-cookie)

#+end_src

- =org-babel-tangle-finished-hook= is run after post-tangle hooks, in the original buffer.
**** functions
:PROPERTIES:
:CUSTOM_ID: functions
:END:
- =org-babel-map-src-blocks=
- =org-sbe=
*** Related examples from the internet
:PROPERTIES:
:CUSTOM_ID: related-examples-from-the-internet
:END:
[[https://github.com/fniessen/refcard-org-babel][org babel refcard / cheatsheet]]
**** [[https://emacs.stackexchange.com/a/46721][Use :noweb functionality to include variable values in tangled files]]
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 20:50]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: use-noweb-functionality-to-include-variable-values-in-tangled-files
:END:

**** [[https://www.reddit.com/r/orgmode/comments/1cklpow/ansible_like_variables_in_orgmodebabeltangle/][lisp in header argument for conditional evaluation]]
:PROPERTIES:
:CUSTOM_ID: lisp-in-header-argument-for-conditional-evaluation
:END:
#+NAME: common-config
#+begin_src conf :tangle no
  timezone=Europe/Berlin
#+end_src

#+begin_src conf :noweb yes :tangle (if (string-equal (system-name) "pc1") "~/tmp/babeltest/theconfig" "no")
  hostname=pc1
  <<common-config>>
#+end_src

#+begin_src conf :noweb yes :tangle (if (string-equal (system-name) "pc2") "~/tmp/babeltest/theconfig" "no")
  hostname=pc2
  <<common-config>>
#+end_src

**** [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-elisp.html#org46f2da5][Tangling with variables]]
:PROPERTIES:
:CUSTOM_ID: tangling-with-variables
:END:
***** Notes
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 02:21]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: notes
:END:
Has a direct example of trying to keep a lexical binding directive at the top of the file
**** [[https://eschulte.github.io/org-scraps/][Eric Schulte's org scraps]]
:PROPERTIES:
:LAST_MODIFIED: [2025-07-17 Thu 01:36]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: eric-schultes-org-scraps
:END:
- [[https://eschulte.github.io/org-scraps/scraps/2011-07-19-including-noweb-refs-without-last-newline.html][Including noweb refs without the last newline]]
- [[https://eschulte.github.io/org-scraps/scraps/2011-07-25-expand-noweb-refs.html][Expand noweb refs]] 
- [[https://eschulte.github.io/org-scraps/scraps/2010-12-13-tangle-templates.html][Tangle templates]]
* Emacs user directory files (init and early-init)
:PROPERTIES:
:CUSTOM_ID: emacs-user-directory-files-init-and-early-init
:LAST_MODIFIED: [2025-07-19 Sat 19:02]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
** Early init
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el :comments noweb
:CUSTOM_ID: early-init
:LAST_MODIFIED: [2025-07-21 Mon 02:43]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Emacs loads the early init file before the package system and the GUI, so
modifications to them should be made here and other customizations left to init.
See [[info:emacs#Early Init File][info: Early Init File]]

#+name: early-init header
#+begin_src emacs-lisp :comments no
;;; early-init.el --- before package.el, GUI -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:

#+end_src

*** Optimizations for early-init
:PROPERTIES:
:CUSTOM_ID: optimizations-for-early-init
:LAST_MODIFIED: [2025-07-21 Mon 03:10]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Defer garbage collection until later in the startup process. On 2025-07-21 I conducted a very simple experiment of clocking my init three times with and without this trick enabled, and the time savings are shown in the table below:
#+name: Average startup time saved by this trick
| Run | GC Time (ms) | Percentage of total startup time |
|-----+--------------+----------------------------------|
|   1 |          247 |                              25% |
|   2 |          245 |                              24% |
|   3 |          245 |                              24% |
|     |              |                                  |

#+begin_src emacs-lisp
;; Defer garbage collection further back in the startup process
(setq gc-cons-threshold most-positive-fixnum gc-cons-percentage 0.6)
(add-hook 'emacs-startup-hook
          (defun reset-gc-cons-threshold ()
            (setq gc-cons-threshold 100000000 gc-cons-percentage 0.1))
          )
#+end_src

Honestly this makes me wonder if I should increase the gc threshold in general. My emacs config is very unoptimized and has more than  hundred packages but its memory footprint is still quite small compared to my available memory.

*** Disable package initialization for elpaca
:PROPERTIES:
:CUSTOM_ID: disable-package-initialization-for-elpaca
:LAST_MODIFIED: [2025-07-21 Mon 03:12]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
;; Inhibit package initialize
(setq package-enable-at-startup nil)
#+end_src

*** Configure GUI elements
:PROPERTIES:
:CUSTOM_ID: configure-gui-elements
:LAST_MODIFIED: [2025-07-21 Mon 03:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Frame parameters need to be set in early init. It's been a while since I set
these but if memory serves some of these frame options are to make Emacs play
nicely with a tiling window manager. The =ns= stuff is for Mac OS and refers to
NeXTSTEP which was the basis for the Mac OS GUI like 30 years ago.

#+begin_src emacs-lisp
;; Inhibit resizing frame
(setq frame-inhibit-implied-resize t)

;; Remove some unneeded UI elements
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(internal-border-width . 0) default-frame-alist)
(when (featurep 'ns)
  (push '(ns-transparent-titlebar . t) default-frame-alist)
  (setq frame-resize-pixelwise t
        window-resize-pixelwise t
        ns-pop-up-frames nil)
  )
#+end_src

*** Disable byte compilation warnings
:PROPERTIES:
:CUSTOM_ID: disable-byte-compilation-warnings
:LAST_MODIFIED: [2025-07-21 Mon 03:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
;; Inhibit byte-compiler warnings
(setq byte-compile-warnings nil)
#+end_src
*** early-init footer
:PROPERTIES:
:CUSTOM_ID: early-init-footer
:END:
#+name: early-init footer
#+begin_src emacs-lisp :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; early-init.el ends here
#+end_src

** init.el
:PROPERTIES:
:CUSTOM_ID: initel
:LAST_MODIFIED: [2025-07-19 Sat 04:30]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header-args: :tangle init.el :comments noweb 
:END:

while still having tangle/detangle functionality. Shouldn't be too difficult honestly because the first line can be inferred from the filename

#+name: header-init
#+begin_src emacs-lisp :comments no
;;; init.el --- Initialize configuration -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:
#+end_src
