its-lit.org
*** Bootstrap Elpaca package manager
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:46]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: bootstrap-elpaca-package-manager
:END:
#+name: init elpaca
#+begin_src emacs-lisp :tangle init.el :comments noweb
;; ===================== Elpaca bootstrap install ====================
;; https://github.com/progfolio/elpaca?tab=readme-ov-file#installer
(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
;; ======================== END: elpaca bootstrap ========================

(elpaca elpaca-use-package
  ;; Enable :elpaca use-package keyword.
  (elpaca-use-package-mode)
  ;; Assume :elpaca t unless otherwise specified.
  (setq elpaca-use-package-by-default t)
  )

(elpaca-wait) ; Block until current queue processed.
#+end_src
*** Define constants to use as conditional configuration flags
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: define-constants-to-use-as-conditional-configuration-flags
:END:

I find =(when IS-MAC ...)= to be clearer and shorter than checking the system type
and remembering that MAC is called darwin here and ns in other places. I'm
probably being fast and loose with system type and GUI/non-GUI configuration. 

#+name: constant flags
#+begin_src emacs-lisp
;; ============== Define constants for use throughout config =============
(defconst IS-MAC (eq system-type 'darwin))
(defconst IS-LINUX (memq system-type '(gnu gnu/linux gnu/kfreebsd berkeley-unix)))
(defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
(defconst IS-ANDROID (eq system-type 'android))

(defconst my-debug-mode nil
  "Toggle debugging messages. Set to t to enable, nil to disable.")
#+end_src
*** Declare packages that are immediately loaded
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:48]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: declare-packages-that-are-immediately-loaded
:END:
These packages have to be loaded immediately becuase they either provide
=use-package= keywords or change how intialization works in some way.
**** no-littering
:PROPERTIES:
:CUSTOM_ID: no-littering
:LAST_MODIFIED: [2025-07-19 Sat 04:28]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

A fantastically useful package that unifies the myriad paths emacs packages use
to store configuration and storage files. There's a lot of manual work behind
the magic so newer or less popular packages might not be incorporated. 
#+name: no-littering
#+begin_src emacs-lisp :noweb yes :comments noweb :tangle init.el 
;; ============== Packages that change core functionality =============
(use-package no-littering :ensure (:wait t))
#+end_src

**** General for keybinds
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: general-for-keybinds
:END:

I lifted the tyrant and despot definer and naming scheme from [[https://github.com/tshu-w/.emacs.d][tshu-w's config
(gh link)]]
#+name: general declaration
#+begin_src emacs-lisp
(use-package general
  :ensure (:wait t)
  :demand t
  :config  (setopt general-emit-autoloads nil)
  (general-define-key
   :states '(normal insert motion emacs)
   :keymaps 'override
   :prefix-map 'tyrant-map
   :prefix "SPC"
   :non-normal-prefix "M-SPC")

  (general-create-definer tyrant-def :keymaps 'tyrant-map)
  (tyrant-def "" nil)

  (general-create-definer despot-def
    :states '(normal insert motion emacs)
    :keymaps 'override
    :major-modes t
    :prefix "SPC m"
    :non-normal-prefix "M-SPC m")
  (despot-def "" nil)

  (general-def universal-argument-map
    "SPC u" 'universal-argument-more)

  )
#+end_src

**** Benchmark init time
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: benchmark-init-time
:END:

I don't optimize for it, but I've frequently found slow init times to indicate
mistakes in my configuration.
#+name: benchmark init declaration
#+begin_src emacs-lisp
(use-package benchmark-init
  :config (add-hook 'elpaca-after-init-hook 'benchmark-init/deactivate)
  )
#+end_src
