its-lit.org
*** Load configuration files
:PROPERTIES:
:CUSTOM_ID: load-configuration-files
:LAST_MODIFIED: [2025-10-26 Sun 02:58]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+name: load configuration files
#+begin_src emacs-lisp :noweb yes :comments noweb :tangle init.el 
;;;; =========== Load use-package declarations and configuration =======

;; Declarations to executed immediately. I.e. those with elpaca
;; :ensure (:wait t)
;; :demand t
(load-file (expand-file-name "config/setup-evil.el" user-emacs-directory))

;;;; =========================== Load lisp defuns ======================
;; Add personal `lisp` directory to the load-path
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

;; --- Load personal library files ---
(require 'my-core-functions)
(require 'my-core-helpers)
(require 'my-editor-helpers)
(require 'my-keybinding-helpers)
(require 'my-lang-helpers)
(require 'my-lsp-bridge-helpers)
(require 'my-org-helpers)
(require 'my-theme-helpers)
(require 'my-vc-helpers)

;; General delcarations that can be handled by elpaca/use-package queueing
(let ((config-dir (expand-file-name "config" user-emacs-directory)))
  (dolist (file
           '(
             "configure-base-and-built-in.el"
             "configure-keybinding.el"
             "configure-org.el"
             "configure-theming.el"
             "configure-utilities.el"
             "configure-prog-langs.el"
             "configure-prog-tools.el"
             ;; "setup-casual.el"
             ;;              ;; "setup-completion-actions.el"
             "setup-completion-backends.el"
             "setup-completion-display.el"
             "setup-completion.el"
             "setup-consult.el"
             ;; "setup-data-formats.el"
             ;; "setup-denote.el"
             ;; "setup-diagramming.el"
             ;; "setup-eaf.el"
             ;; "setup-emacs.el"
             ;;              ;; "setup-email.el"
             "setup-evil-addons.el"
             "setup-font-locking.el"
             ;;              ;; "setup-go.el"
             ;;              ;; "setup-gopher.el"
             ;;              ;; "setup-icons.el"
             ;;              ;; "setup-lisp.el"
             "setup-llm.el"
             ;;              ;; "setup-media.el"
             "setup-modeline.el"
             ;;              ;; "setup-notes.el"
             ;;              ;; "setup-programming.el"
             ;; "setup-projects.el"
             "setup-reading.el"
             "setup-ui.el"
             "setup-vc.el"
             ;; "setup-web.el"
             ;; "setup-writing.el"
             "writing-in-emacs.el"
             )
           )
    (load-file (expand-file-name file config-dir))
    )
  )
#+end_src

*** Load custom file and run after-init hooks
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:29]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: load-custom-file-and-run-after-init-hooks
:END:
#+begin_src
;;;; =============================== Customs ===============================
(setq custom-file (expand-file-name "customs.el" user-emacs-directory))
(add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror)))
#+end_src

*** Local variable footer for init
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:30]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: local-variable-footer-for-init
:END:
#+name: footer-init
#+begin_src emacs-lisp :tangle init.el :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; init.el ends here
#+end_src

* Config directory for non-byte-compiled files
:PROPERTIES:
:CUSTOM_ID: config-directory-for-non-byte-compiled-files
:LAST_MODIFIED: [2026-02-02 Mon 21:32]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

** One stop keybinding shop
:PROPERTIES:
:header-args: :tangle config/configure-keybinding.el :comments noweb
:LAST_MODIFIED: [2025-07-18 Fri 18:07]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: one-stop-keybinding-shop
:END:
#+begin_src emacs-lisp :noweb no :comments no
;;; configure-keybinding.el --- All things keys -*- lexical-binding: t; -*-
;;; Commentary:
;; See `its-lit.org`
;;; Code:
#+end_src
*** Keyboard macros
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 02:29]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: keyboard-macros
:END:
Recommended reading: [[https://www.masteringemacs.org/article/keyboard-macros-are-misunderstood][Keyboard Macros are misunderstood]]
#+begin_src emacs-lisp 
;;;; =========================== Keyboard macros ==========================
(defalias 'kmacro-insert-macro 'insert-kbd-macro)

(defalias 'targets_string_to_tar_read
   (kmacro "w w v w w w w w h y 0 p a SPC < - SPC t a r _ r e a d ( <kp-delete> <kp-delete> <kp-delete> <escape> $ a <backspace> ) <escape>"))
#+end_src
