init.el

;; Declarations to executed immediately. I.e. those with elpaca
;; :ensure (:wait t)
;; :demand t
(load-file (expand-file-name "config/setup-evil.el" user-emacs-directory))

;;;; =========================== Load lisp defuns ======================
;; Add personal `lisp` directory to the load-path
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

;; --- Load personal library files ---
(require 'my-core-functions)
(require 'my-core-helpers)
(require 'my-editor-helpers)
(require 'my-keybinding-helpers)
(require 'my-lang-helpers)
(require 'my-lsp-bridge-helpers)
(require 'my-org-helpers)
(require 'my-theme-helpers)
(require 'my-vc-helpers)

;; General delcarations that can be handled by elpaca/use-package queueing
(let ((config-dir (expand-file-name "config" user-emacs-directory)))
  (dolist (file
           '(
             ;; "setup-bib.el"
             "configure-base-and-built-in.el"
             "configure-keybinding.el"
             "configure-org.el"
             "configure-theming.el"
             "configure-utilities.el"
             "configure-prog-langs.el"
             "configure-prog-tools.el"
             ;; "setup-casual.el"
             ;;              ;; "setup-completion-actions.el"
             "setup-completion-backends.el"
             "setup-completion-display.el"
             "setup-completion.el"
             "setup-consult.el"
             ;; "setup-data-formats.el"
             ;; "setup-denote.el"
             ;; "setup-diagramming.el"
             ;; "setup-eaf.el"
             ;; "setup-emacs.el"
             ;;              ;; "setup-email.el"
             "setup-evil-addons.el"
             "setup-font-locking.el"
             ;;              ;; "setup-go.el"
             ;;              ;; "setup-gopher.el"
             ;;              ;; "setup-icons.el"
             ;;              ;; "setup-lisp.el"
             "setup-llm.el"
             "setup-markdown.el"
             ;;              ;; "setup-media.el"
             "setup-modeline.el"
             ;;              ;; "setup-notes.el"
             ;;              ;; "setup-programming.el"
             ;; "setup-projects.el"
             "setup-reading.el"
             ;; "setup-treesit.el"
             "setup-ui.el"
             "setup-vc.el"
             ;; "setup-web.el"
             ;; "setup-writing.el"
             )
           )
    (load-file (expand-file-name file config-dir))
    )
  )
;; load configuration files ends here

;; [[file:its-lit.org::#load-custom-file-and-run-after-init-hooks][Load custom file and run after-init hooks:1]]
;;;; =============================== Customs ===============================
(setq custom-file (expand-file-name "customs.el" user-emacs-directory))
(add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror)))
;; Load custom file and run after-init hooks:1 ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; init.el ends here
