its-lit.org
**** Currently unused base configuration
:PROPERTIES:
:LAST_MODIFIED: [2025-07-21 Mon 18:24]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: currently-unused-base-configuration
:END:

These are out temporarily while sorting through what to keep.

See [[info:elisp#Special Properties][elisp#Special Properties]] for intangible explanation

#+name: Unset emacs options
#+begin_src emacs-lisp :tangle no
;;  :init
;; (setq trash-directory "~/.Trash")

(setopt delete-by-moving-to-trash t) ; use system trash for file deletion

;; autosave each change
(setopt bookmark-save-flag 1)

;; keep focus while navigating help buffers
(setopt help-window-select t)

;; don't save duplicates in kill-ring
(setopt kill-do-not-save-duplicates t)

;; break lines after more characters
;; Seems mostly for for CJK characters?
(setopt word-wrap-by-category t)

;; Do not allow the cursor in the minibuffer prompt
(setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src
*** Configuring built-in packages
:PROPERTIES:
:LAST_MODIFIED: [2026-01-21 Wed 19:25]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configuring-built-in-packages
:END:

#+begin_src emacs-lisp 
(use-package autorevert
  :ensure nil
  :hook (elpaca-after-init . global-auto-revert-mode)
  :config
  (setopt global-auto-revert-non-file-buffers t
          auto-revert-verbose nil
  )
)

(use-package dired
  :ensure nil
  :defer t
  :config
  (setopt dired-auto-revert-buffer t
          dired-kill-when-opening-new-dired-buffer  t
          dired-create-destination-dirs 'always
          dired-do-revert-buffer t
          dired-dwim-target t
          dired-vc-rename-file t
          dired-listing-switches "-alh"
          )
  )

;; (use-package paren
;;   :ensure nil
;;   :defer t
;;   :config
;;   (show-paren-mode 1)
;;   (setq show-paren-style 'expression)
;;   (setq show-paren-delay 0.05)
;;   )

#+end_src
**** Removed built-in configuration
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: removed-built-in-configuration
:END:

Off the top of my head, I think
- I broke =desktop= regularly but I haven't used it in so long that it's 99.9% of
  user error.
- =dabbrev= conflicts with =acm= the completion package for =lsp-bridge=
- =repeat= doesn't have any customization and just isn't necessary as it's builtin?
- =sqlite= was trying to make sure I was using the builtin version


#+name: removed built-in package declarations
#+begin_src emacs-lisp :tangle no :eval no :comments no
(use-package desktop
  :disabled
  :ensure nil
  :commands restart-emacs-without-desktop
  :init (desktop-save-mode)
  :config
  ;; inhibit no-loaded prompt
  (setopt desktop-file-modtime (file-attribute-modification-time
                                (file-attributes
                                 (desktop-full-file-name)))
          desktop-lazy-verbose nil
          desktop-load-locked-desktop t
          desktop-restore-eager nil
          desktop-save t)

  (dolist (param '(foreground-color background-color background-mode font cursor-color mouse-color))
    (push `(,param . :never) frameset-filter-alist))

  (advice-add 'desktop-read :around #'desktop-read@inhibit-message))
(use-package dabbrev
 :ensure nil
 :defer t
 :config
 (setopt dabbrev-abbrev-char-regexp "[A-Za-z-_]"
      dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\'")))

(use-package repeat
 :ensure nil
 :defer t
 )

(use-package sqlite
 :ensure nil)
#+end_src

*** Configure built-in programming utilities
:PROPERTIES:
:LAST_MODIFIED: [2025-07-25 Fri 01:04]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-built-in-programming-utilities
:END:
- =glasses= separates CamelCase words visually into '=Camel_Case='
#+begin_src emacs-lisp
(use-package display-line-numbers
  :ensure nil
  :hook ((text-mode prog-mode conf-mode) . display-line-numbers-mode)
  :config
  (setopt display-line-numbers-type t
          display-line-numbers-width-start 100)
  )

(use-package elec-pair
  :ensure nil
  :hook (elpaca-after-init . electric-pair-mode)
  )


(use-package flymake
  :disabled
  :ensure nil
  :hook (prog-mode . flymake-mode)
;; no idea what this is from, I don't see the function in help so may be outdated
;; :init (remove-hook 'flymake-diagnostic-functions 'flymake-proc-legacy-flymake)
  )

(use-package glasses
	:ensure nil
	:hook (ess-r-mode . glasses-mode)
	:config
	(setopt glasses-separate-parentheses-p nil)
)

(use-package whitespace
  :ensure nil
  :hook (diff-mode . whitespace-mode)
  )
#+end_src

*** Configure ediff for viewing diffs
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-ediff-for-viewing-diffs
:END:

I really need to learn how to use =ediff= properly
#+begin_src emacs-lisp
(use-package ediff
  :ensure nil
  :defer t
  :config
  (setopt ediff-window-setup-function 'ediff-setup-windows-plain
          ediff-split-window-function 'split-window-horizontally
          ediff-merge-split-window-function 'split-window-horizontally
          )
  )

#+end_src

*** Outline mode configuration
:PROPERTIES:
:LAST_MODIFIED: [2025-08-03 Sun 18:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: outline-mode-configuration
:END:

#+begin_src emacs-lisp
(use-package outline
  :ensure nil
  :defer t
  :hook (text-mode . outline-minor-mode)
  :config
   (setopt outline-minor-mode-highlight t)
   )
#+end_src

*** Treesitter
:PROPERTIES:
:CUSTOM_ID: treesitter
:LAST_MODIFIED: [2026-01-15 Thu 00:23]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp 
(use-package treesit
  :ensure nil
	:defer t
	:config
	(setopt treesit-language-source-alist
				'(
					(bash "https://github.com/tree-sitter/tree-sitter-bash")
          (bibtex "https://github.com/latex-lsp/tree-sitter-bibtex")
					(cmake "https://github.com/uyha/tree-sitter-cmake")
					(css "https://github.com/tree-sitter/tree-sitter-css")
          (dart "https://github.com/UserNobody14/tree-sitter-dart")
          (diff "https://github.com/the-mikedavis/tree-sitter-diff")
          (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
          (dot "https://github.com/rydesun/tree-sitter-dot")
          (editorconfig "https://github.com/ValdezFOmar/tree-sitter-editorconfig")
					(elisp "https://github.com/Wilfred/tree-sitter-elisp")
					(go "https://github.com/tree-sitter/tree-sitter-go")
					(html "https://github.com/tree-sitter/tree-sitter-html")
					(javascript "https://github.com/tree-sitter/tree-sitter-javascript")
          (jinja2 "https://github.com/dbt-labs/tree-sitter-jinja2")
					(json "https://github.com/tree-sitter/tree-sitter-json")
          (latex "https://github.com/latex-lsp/tree-sitter-latex")
          (lean "https://github.com/Julian/tree-sitter-lean")
					(make "https://github.com/alemuller/tree-sitter-make")
					(markdown "https://github.com/tree-sitter-grammars/tree-sitter-markdown")
          (matlab "https://github.com/acristoffers/tree-sitter-matlab")
          (mermaid "https://github.com/monaqa/tree-sitter-mermaid")
       ;;   (python  "https://github.com/tree-sitter/py-tree-sitter")
          (python "https://github.com/tree-sitter/tree-sitter-python")
					(r "https://github.com/r-lib/tree-sitter-r")
          (racket "https://github.com/6cdh/tree-sitter-racket")
          (regex "https://github.com/tree-sitter/tree-sitter-regex")
          (rust "https://github.com/tree-sitter/tree-sitter")
					(toml "https://github.com/tree-sitter/tree-sitter-toml")
					(typescript "https://github.com/tree-sitter/tree-sitter-typescript")
					(yaml "https://github.com/ikatyang/tree-sitter-yaml"))
        )
	)
#+end_src

**** Inactive treesitter 
:PROPERTIES:
:CUSTOM_ID: inactive-treesitter
:LAST_MODIFIED: [2025-07-31 Thu 18:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :eval no :comments no :tangle no 
(use-package typespec-ts-mode
	:mode ("\\.tsp\\'" . typespec-ts-mode)
	:config
	(add-to-list
 'treesit-language-source-alist
 '(typespec "https://github.com/happenslol/tree-sitter-typespec"))
	)
#+end_src


*** Built-in package configuration that were in a separate file for some reason
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: built-in-package-configuration-that-were-in-a-separate-file-for-some-reason
:END:

#+begin_src emacs-lisp
(use-package doc-view
  :ensure nil
  :defer t
  :config (setopt doc-view-resolution 330)
  )

(use-package files
  :ensure nil
  :defer t
  :config
  (add-to-list 'find-file-not-found-functions 'make-directory-maybe nil #'eq)
  )

(use-package newcomment
  :ensure nil
  :defer t
  :commands comment-or-uncomment
  :config
  (defun comment-or-uncomment (n)
    (interactive "*p")
    (if (or (region-active-p)
            (save-excursion
              (beginning-of-line)
              (looking-at "\\s-*$")))
        (call-interactively 'comment-dwim)
      (comment-or-uncomment-region
       (line-beginning-position) (line-end-position n)))))

(use-package project
  :ensure nil
  :defer t
  :config
  (setopt project-vc-merge-submodules nil
          project-switch-commands '((project-switch-to-buffer "Find buffer")
                                    (project-find-file "Find file")
                                    (project-find-regexp "Find regexp")
                                    (project-find-dir "Find directory"))
          project-switch-use-entire-map t
          )
  (add-to-list 'project-find-functions 'project-try-root t)
  )

(use-package recentf
  :ensure nil
  :defer t
  :custom (recentf-mode 1)
  :config (setopt recentf-auto-cleanup 'never
                  recentf-max-saved-items 250)
  )

(use-package savehist
  :ensure nil
  :defer t
  :custom (savehist-mode 1)
  :config
  (setopt enable-recursive-minibuffers t ; allow commands in minibuffers
          history-length 500
          savehist-autosave-interval nil
          savehist-additional-variables '(evil-jumps-history
                                          mark-ring global-mark-ring
                                          search-ring regexp-search-ring
                                          extended-command-history)
          )
  (add-hook 'savehist-save-hook #'savehist-unpropertize-variables-h)
  (add-hook 'savehist-save-hook #'savehist-remove-unprintable-registers-h)
  )


(use-package saveplace
  :ensure nil
  :custom (save-place-mode 1))

(use-package simple
  ;; basic editing commands for emacs
  :ensure nil
  :defer t
  :config
  (setopt column-number-mode t
          delete-trailing-lines nil
          eval-expression-print-length nil
          eval-expression-print-level nil
          next-error-message-highlight t
          ;; save clipboard contents into kill-ring before replace them
          save-interprogram-paste-before-kill t
          )
  )

(use-package winner
  :ensure nil
  :defer t
  :commands (winner-undo winner-redo)
  :init
  (setq winner-dont-bind-my-keys t)
  :custom
  (winner-mode 1)
  :config
  (setopt winner-boring-buffers-regexp "\\*.*\\*")
  )
#+end_src

*** =which-key= configuration
:PROPERTIES:
:CUSTOM_ID: which-key-configuration
:LAST_MODIFIED: [2025-07-18 Fri 18:00]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
=which-key= is built in now (starting with Emacs 30?)

#+begin_src emacs-lisp
(use-package which-key
  :ensure nil
  :hook (elpaca-after-init)
  :config
  (setopt which-key-idle-delay 0.4
        which-key-idle-secondary-delay 0.01
        which-key-max-description-length 32
        which-key-sort-order 'which-key-key-order-alpha
        which-key-allow-evil-operators t)
  (push '((nil . "tab-bar-select-tab") . t) which-key-replacement-alist))
#+end_src

*** Base and built-in configuration footer
:PROPERTIES:
:CUSTOM_ID: base-and-built-in-configuration-footer
:LAST_MODIFIED: [2025-07-18 Fri 19:04]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no :noweb no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-base-and-built-in ends here
#+end_src
** Editor utilities and "core" functionality
:PROPERTIES:
:header-args: :tangle config/configure-utilities.el :comments noweb
:CUSTOM_ID: editor-utilities-and-core-functionality
:LAST_MODIFIED: [2025-07-20 Sun 02:46]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+name: header for utilities and core configuration
#+begin_src emacs-lisp :comments no
;;; configure-utilities.el --- editor add-ons -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src
*** Configure editor utility packages
:PROPERTIES:
:CUSTOM_ID: configure-editor-utility-packages
:LAST_MODIFIED: [2025-07-20 Sun 03:52]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no

;;;; ========================= Utility packages ========================
#+end_src
**** Comment utilities
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:52]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: banner-comments
:END:

I'm a big fan of the look of banner comments but trying to set a custom prefix it wasn't clear how to keep the language-adaptive comment symbol and add a string afterwards. I always want a space
[[info:elisp#Syntax Table Functions][elisp#Syntax Table Functions]]


#+name: comment tools
#+begin_src emacs-lisp
(use-package banner-comment
  :config  (setopt banner-comment-width 68)
  :general  (tyrant-def "ab" 'banner-comment)
  )
#+end_src
**** Utilities for interact with the operating system
:PROPERTIES:
:LAST_MODIFIED: [2025-07-21 Mon 18:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: utilities-for-interact-with-the-operating-system
:END:

Do a thing here helpers. I wonder if these could be replaced with built-in functionality. 
#+name: open here utilities
#+begin_src emacs-lisp 
(use-package reveal-in-folder
  :general (tyrant-def "bf" 'reveal-in-folder))

(use-package terminal-here
  :init (setq terminal-here-mac-terminal-command 'ghostty)
  :general
  (tyrant-def "'" '("terminal here" . terminal-here-launch)
    "p '" '("terminal project root" . terminal-here-project-launch)
    )
  )
#+end_src

#+name: dwim shell commands
#+begin_src emacs-lisp :eval no
(use-package dwim-shell-command
  :general (tyrant-def "fm" 'dwim-shell-commands-rename-all)
  )
#+end_src

