config/configure-utilities.el
;;; configure-utilities.el --- editor add-ons -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

;;;; ========================= Utility packages ========================

;; [[file:../its-lit.org::comment tools][comment tools]]
(use-package banner-comment
  :config  (setopt banner-comment-width 68)
  :general  (tyrant-def "ab" 'banner-comment)
  )
;; comment tools ends here

;; [[file:../its-lit.org::open here utilities][open here utilities]]
(use-package reveal-in-folder
  :general (tyrant-def "bf" 'reveal-in-folder))

(use-package terminal-here
  :init (setq terminal-here-mac-terminal-command 'ghostty)
  :general
  (tyrant-def "'" '("terminal here" . terminal-here-launch)
    "p '" '("terminal project root" . terminal-here-project-launch)
    )
  )
;; open here utilities ends here

;; [[file:../its-lit.org::dwim shell commands][dwim shell commands]]
(use-package dwim-shell-command
  :general (tyrant-def "fm" 'dwim-shell-commands-rename-all)
  )
;; dwim shell commands ends here
