its-lit.org
**** Scratch buffer utilities
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:41]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: scratch-buffer-utilities
:END:

#+begin_src emacs-lisp
;; Conveniently create scratches in the same mode as the current file
(use-package scratch
  :general (tyrant-def "bS" 'scratch))
#+end_src
**** Search utilities
:PROPERTIES:
:CUSTOM_ID: search-utilities
:LAST_MODIFIED: [2025-07-20 Sun 03:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Don't know if this is still the case but for a spell the emacs package wouldn't find the homebrew executable when run as a daemon.
#+begin_src emacs-lisp
(use-package rg
  :config (when (and IS-MAC (daemonp)) (setopt rg-executable "/opt/homebrew/bin/rg"))
  :general (tyrant-def   "fr" 'rg
                         "fR" 'rg-menu
             )
	)
#+end_src

***** Removed search-related packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:03]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: removed-search-related-packages
:END:

#+begin_src emacs-lisp :tangle no :comments no
(use-package wgrep
  :disabled)

(use-package manage-minor-mode-table
  :disabled
  :general
  (tyrant-def "am" 'manage-minor-mode-table)
 )
#+end_src
**** Terminal configuration
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:55]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: terminal-configuration
:END:

#+begin_src emacs-lisp
(use-package vterm
  :general (tyrant-def "av" 'vterm
                       "aV" 'vterm-other-window
                       )
  )
#+end_src
*** Data format modes
:PROPERTIES:
:CUSTOM_ID: data-format-modes
:LAST_MODIFIED: [2025-08-10 Sun 17:56]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp
;;;; ======================= Data file format modes ======================

(use-package csv-mode
  :mode ("\\.[cC][sS][vV]\\'" . csv-mode)
  :config
  (add-hook 'csv-mode-hook 'csv-guess-set-separator)
	(add-hook 'csv-mode-hook (lambda () (visual-fill-column-mode -1)))

:general
  (despot-def csv-mode-map
    "s" 'csv-sort-fields
    "n" 'csv-sort-numeric-fields
    "r" 'csv-reverse-region
    "k" 'csv-kill-fields
    "y" 'csv-yank-fields
    "a" 'csv-align-fields
    "A" 'csv-align-mode
    "u" 'csv-unalign-fields
    "t" 'csv-transpose
    )
  )
#+end_src
***** Removed data viewers
:PROPERTIES:
:LAST_MODIFIED: [2025-07-21 Mon 00:19]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: removed-data-viewers
:END:

- The =toml= package is for parsing toml into lisp. Currently not feature complete, has problems with literal strings. The built-in packages =conf-mode= and =toml-ts-mode= have modes for toml files.
  
#+begin_src emacs-lisp :tangle no :comments no

;; a high-level Emacs Lisp front-end for SQLite
;; epkg depends on it, I forget if I was manually declaring it for another reason
(use-package emacsql)

(use-package toml
  :mode ("\\.[tT][oO][mM][lL]\\'" . toml-mode)
  )

(use-package json-navigator
	:disabled
	)

(use-package jsonian
	:disabled
	:mode ("\\.json\\'")
	:after so-long
  :custom
  (jsonian-no-so-long-mode))

#+end_src
*** Modify core editor functioning
:PROPERTIES:
:CUSTOM_ID: modify-core-editor-functioning
:LAST_MODIFIED: [2025-07-20 Sun 03:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no

;;;; ================= Modify core editor functionality ================
#+end_src

**** Smooth scrolling
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 02:48]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: smooth-scrolling
:END:
Who knew scrolling could be so hard?
#+begin_src emacs-lisp 
(use-package ultra-scroll
  :ensure (ultra-scroll :type git :host github :repo "jdtsmith/ultra-scroll")
  :init  (setq scroll-conservatively 50
               scroll-margin 0) 
  :config (ultra-scroll-mode 1)
  )
#+end_src
**** Setup help and documentation viewers
:PROPERTIES:
:CUSTOM_ID: setup-help-and-documentation-viewers
:LAST_MODIFIED: [2025-07-20 Sun 03:26]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package helpful
  :config
  (setq helpful-max-buffers 3
        helpful-switch-buffer-function #'helpful-reuse-window)

  (with-eval-after-load 'ibuffer
    (add-to-list 'ibuffer-help-buffer-modes 'helpful-mode))
  :general
  ([remap describe-command]  'helpful-command
   [remap describe-function] 'helpful-callable
   [remap describe-key]      'helpful-key
   [remap describe-symbol]   'helpful-symbol
   [remap describe-variable] 'helpful-variable))
#+end_src

**** Configuring how undo works
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:42]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configuring-how-undo-works
:END:

#+begin_src emacs-lisp
(use-package undo-fu
  :config (setopt evil-undo-system 'undo-fu)
  )

(use-package undo-fu-session
  :custom (undo-fu-session-global-mode t)
  )
#+end_src
**** Windowing
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: windowing
:END:
Window numbering
#+begin_src emacs-lisp
(use-package winum
  :hook (elpaca-after-init . winum-mode)
  :init
  (with-eval-after-load 'which-key
    (push '((nil . "winum-select-window-[1-9]") . t) which-key-replacement-alist)
    (push '((nil . "buffer-to-window-[1-9]") . t) which-key-replacement-alist))
  :config
  (setq winum-auto-assign-0-to-minibuffer t
        winum-auto-setup-mode-line t
        winum-scope 'frame-local)

  (dotimes (i 9)
    (let ((n (+ i 1)))
      (eval `(defun ,(intern (format "buffer-to-window-%s" n)) (&optional arg)
               ,(format "Move buffer to the window with number %i." n)
               (interactive "P")
               (if arg
                   (move-buffer-to-window ,n t)
                 (swap-buffers-to-window ,n t))))))
  :general
  (tyrant-def
    "1"  '("window 1..9" . winum-select-window-1)
    "2"  'winum-select-window-2
    "3"  'winum-select-window-3
    "4"  'winum-select-window-4
    "5"  'winum-select-window-5
    "6"  'winum-select-window-6
    "7"  'winum-select-window-7
    "8"  'winum-select-window-8
    "9"  'winum-select-window-9
    "b1" '("Move buffer to window 1..9" . buffer-to-window-1)
    "b2" 'buffer-to-window-2
    "b3" 'buffer-to-window-3
    "b4" 'buffer-to-window-4
    "b5" 'buffer-to-window-5
    "b6" 'buffer-to-window-6
    "b7" 'buffer-to-window-7
    "b8" 'buffer-to-window-8
    "b9" 'buffer-to-window-9)
  )
#+end_src
*** Outline and fold text
:PROPERTIES:
:CUSTOM_ID: outline-and-fold-text
:LAST_MODIFIED: [2025-10-19 Sun 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp 
(use-package outline-indent
  :commands outline-indent-minor-mode
  :hook ((python-mode python-ts-mode yaml-mode yaml-ts-mode) . outline-indent-minor-mode)
  :custom
  (outline-indent-ellipsis "  ")
  :general
  (tyrant-def
    "to" 'outline-indent-minor-mode
    "o"  (cons "outline" (make-sparse-keymap))
    "oa" '("all open" . outline-indent-open-folds)
    "oA" '("all closed" . outline-indent-close-folds)
    "ob" 'bicycle-cycle
    "oB" 'bicycle-cycle-global
    "oc" 'outline-indent-close-fold
    "oj" 'outline-forward-same-level
    "ok" 'outline-backward-same-level
    "oh" 'hs-minor-mode
    "oo" 'outline-indent-open-fold
    "oO" 'outline-minor-mode
    "or" 'outline-indent-open-fold-rec
    "ot" 'bicycle-cycle
    "oT" 'bicycle-cycle-global
    "oz" 'TeX-fold-mode)
  )
#+end_src

*** Spell check with jinx
:PROPERTIES:
:LAST_MODIFIED: [2025-08-08 Fri 19:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: spell-check-with-jinx
:END:

#+begin_src emacs-lisp
(use-package jinx
  :after evil
  :hook (text-mode . jinx-mode)
  :config
  (add-to-list 'jinx-exclude-regexps '(t "\\cc"))
  (add-to-list 'jinx-exclude-regexps '(LaTeX-mode "\\s*\\input{[^}]+}\\s*"))

  (add-to-list 'jinx-camel-modes 'R-mode)
  (add-to-list 'jinx-camel-modes 'ess-r-mode)

  (with-eval-after-load 'vertico-multiform
    (add-to-list 'vertico-multiform-categories '(jinx grid (vertico-grid-annotate . 20))))
  (with-eval-after-load 'evil
    (evil-define-motion evil-prev-jinx-error (count)
      "Go to the COUNT'th spelling mistake preceding point."
      :jump t (jinx-previous (or count 1)))
    (evil-define-motion evil-next-jinx-error (count)
      "Go to the COUNT'th spelling mistake after point."
      :jump t (jinx-next (or count 1))))
  :general([remap ispell-word] 'jinx-correct-word
           [remap evil-prev-flyspell-error] 'evil-prev-jinx-error
           [remap evil-next-flyspell-error] 'evil-next-jinx-error)
  )

#+end_src

