its-lit.org
*** Text snippet insertion and collections
:PROPERTIES:
:CUSTOM_ID: text-snippet-insertion-and-collections
:LAST_MODIFIED: [2026-01-15 Thu 03:01]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp 
;;;; ========================== Text snippets ==========================
(use-package tempel
  :hook ((text-mode prog-mode) . tempel-setup-capf)
  :init
  (setq tempel-trigger-prefix "<"
        tempel-path "~/.emacs.d/etc/templates/*.eld")
  :config
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-complete
                      completion-at-point-functions)))

  (defun tempel-hippie-try-expand (old)
    "Integrate with hippie expand. Just put this function in `hippie-expand-try-functions-list'." 
    (if (not old)
        (tempel-expand t)
      (undo 1)))

  (add-to-list 'hippie-expand-try-functions-list #'tempel-hippie-try-expand t)
	)

(use-package tempel-collection
  :after tempel)

(use-package yasnippet
;;	:hook ((text-mode prog-mode) . yas-minor-mode)
;;	:config
;;	(setopt yas-global-mode t)
	)

(use-package yasnippet-snippets
	:after yasnippet)
#+end_src

**** Removed snippet packages and customization
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:23]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: removed-snippet-packages-and-customization
:END:

I must've been doing something strange to run into the error with
=tempel-auto-reload= described below. But just in case...

#+begin_src emacs-lisp :tangle no :comments no :eval no
	;;	:custom
	;;	(tempel-auto-reload nil)
	;; I don't want unexpected changes if I update something from a template, but
	;; I think I should use tempel-done when I'm done with a template

(use-package eglot-tempel
	:disabled
  :hook (eglot-managed-mode .  eglot-tempel-mode)
	)
#+end_src
*** Text editing (non-evil)
:PROPERTIES:
:LAST_MODIFIED: [2026-01-13 Tue 16:16]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: text-editing-non-evil
:END:

Incredibly useful package for dealing with "surrounding" a string or region i.e.
inserting characters before and after the region. It's intelligent about
parentheses and similar characters that have opening and closing forms.   

Filling splits texts into lines of a certain length in an intelligent way e.g.
words aren't split and meaningful structures in the major-mode may be preserved.
=unfill= takes lines of text and forms them back into a single line.

#+name: non-evil text editing
#+begin_src emacs-lisp
(use-package surround
  :general
  (tyrant-def
		"Si" 'surround-insert
		"Sd" 'surround-kill
		"Sr" 'surround-replace)
	)

(use-package unfill
	:general
	(general-def '(normal visual) text-mode-map
		"g=" 'unfill-region
		"g+" 'unfill-paragraph
		"t+" 'unfill-toggle)
	)
#+end_src
*** Footer for utilities config
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 02:46]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: footer-for-utilities-config
:END:

#+name: utility config footer
#+begin_src emacs-lisp :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-utilities.el ends here
#+end_src

*** Removed packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 03:37]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header-args: :tangle no :comments no
:CUSTOM_ID: removed-packages
:END:

These packages have the distinction of being useful but I don't use them enough, and if I ever want to use them, I need to add them back in an intentional manner.
=xr=  is for translating and pretty printing regular expressions. I can see its utility but I don't work with regular expressions enough to find it worth keeping.

#+name: useful removed packages
#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package xr)

(use-package password-menu
	;; was using while debugging authinfo api key stuff
	:disabled
	:general
	(tyrant-def "as" 'password-menu-transient)
	)

(use-package substitute
	:general
	(tyrant-def
		"rb" 'substitute-target-in-buffer
		"rd" 'substitute-target-in-defun
		"rj" 'substitute-target-below-point
		"rk" 'substitute-target-above-point)
	:config
	(add-hook 'substitute-post-replace-functions #'substitute-report-operation)
	)

(use-package tmr
	:general
	(tyrant-def "aT" 'tmr-tabulated-view)
	:config
	(setq tmr-sound-file "/usr/share/sounds/freedesktop/stereo/alarm-clock-elapsed.oga")
	(setq tmr-notification-urgency 'normal)
	(setq tmr-descriptions-list 'tmr-description-history)
	(define-key global-map "\C-ct" 'tmr-prefix-map)
	)

(use-package link-hint
  :disabled ; occassionally useful not necessary?
  :config
  (setq link-hint-restore nil)
  :general
  (general-def
    :keymaps '(compilation-mode-map
               custom-mode-map
               eww-link-keymap
               eww-mode-map
               help-mode-map
               helpful-mode-map
               Info-mode-map
               mu4e-view-mode-map
               xref--xref-buffer-mode-map
               woman-mode-map)
    :states  'normal
    "o"      'link-hint-open-link)

  (tyrant-def
    "Jo" 'link-hint-open-link
    "JO" 'link-hint-open-multiple-links
    "Jy" 'link-hint-copy-link)
  )

#+end_src

#+name: removed utilities I don't remember much about
#+begin_src emacs-lisp :eval no :tangle no :comments no
(use-package dumb-jump
  :disabled
  :init
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (setq dumb-jump-selector 'completing-read)
  )
#+end_src
** Configure all things org mode
:PROPERTIES:
:header-args: :tangle config/configure-org.el :comments noweb
:LAST_MODIFIED: [2025-07-18 Fri 23:14]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-all-things-org-mode
:END:

*** Configure org header
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 23:16]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-org-header
:END:
#+begin_src emacs-lisp :comments no :noweb no
;;; configure-org.el --- Org-mode and its children -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

