config/configure-utilities.el
(use-package tempel
  :hook ((text-mode prog-mode) . tempel-setup-capf)
  :init
  (setq tempel-trigger-prefix "<"
        tempel-path "~/.emacs.d/etc/templates/*.eld")
  :config
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-complete
                      completion-at-point-functions)))

  (defun tempel-hippie-try-expand (old)
    "Integrate with hippie expand. Just put this function in `hippie-expand-try-functions-list'." 
    (if (not old)
        (tempel-expand t)
      (undo 1)))

  (add-to-list 'hippie-expand-try-functions-list #'tempel-hippie-try-expand t)
	)

(use-package tempel-collection
  :after tempel)

(use-package yasnippet
	:hook ((text-mode prog-mode) . yas-minor-mode)
	:config
	(setopt yas-global-mode t)
	)

(use-package yasnippet-snippets
	:after yasnippet)
;; Text snippet insertion and collections:1 ends here

;; [[file:../its-lit.org::non-evil text editing][non-evil text editing]]
(use-package surround
  :general
  (tyrant-def
		"Si" 'surround-insert
		"Sd" 'surround-kill
		"Sr" 'surround-replace)
	)

(use-package unfill
	:general
	(general-def '(normal visual) text-mode-map
		"g=" 'unfill-region
		"g+" 'unfill-paragraph
		"t+" 'unfill-toggle)
	)
;; non-evil text editing ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-utilities.el ends here
