its-lit.org
**** org-todoist
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 06:20]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: org-todoist
:END:
#+begin_src emacs-lisp
(use-package org-todoist
  :ensure (:host github
                 :repo "lillenne/org-todoist"
                 :branch "main"
                 )
  :init  (setq org-todoist-api-token (my/get-authinfo-token "api.todoist.com"))
  :config (setopt org-todoist-api-token (my/get-authinfo-token "api.todoist.com"))
  :general (tyrant-def "aT" 'org-todoist-dispatch)
  )
#+end_src
**** Configure Org-node :TODO:
:PROPERTIES:
:CUSTOM_ID: configure-org-node
:LAST_MODIFIED: [2026-02-01 Sun 19:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

TODO - create unique titles for the node sequences by updating the creator
function [[https://github.com/meedstrom/org-node/wiki/Configuring-node-sequences#amendment-custom-titles][see here]] 
[[https://github.com/meedstrom/org-node?tab=readme-ov-file#limitation-unique-titles][Limitation - org-node requires unique titles]]
  

#+begin_src emacs-lisp
(use-package org-mem
  :defer
  :functions org-mem-updater
  :config
  (setopt org-mem-do-sync-with-org-id t
          org-mem-watch-dirs (list "~/obsidian/org/node")
          )
  (org-mem-updater-mode)
  )

(use-package org-node
  :init
  (setq org-node-seq-defs
        (list
       ;; All notes in creation order, 
       ;; according to the timestamps in their :CREATED: property.
       (org-node-seq-def-on-any-sort-by-property
        "a" "All notes by property :CREATED:" "CREATED")       
        (org-node-seq-def-on-filepath-sort-by-basename
          "d" "Dailies" "~/obsidian/org/node/daily/" nil t)
       (let ((m-def (org-node-seq-def-on-filepath-sort-by-basename
                     "m" "Meetings" "~/obsidian/org/node/meetings/" nil t)))
         (plist-put (cdr m-def) :prompter
                    (lambda (key)
                      (let ((date (let ((org-node-seq-that-marks-calendar key))
                                    (org-read-date))))
                        (concat "Meeting " date))))
         m-def)

       (let ((p-def (org-node-seq-def-on-filepath-sort-by-basename
                     "p" "Painting log" "~/obsidian/org/node/painting-log/" nil t)))
         (plist-put (cdr p-def) :prompter
                    (lambda (key)
                      (let ((date (let ((org-node-seq-that-marks-calendar key))
                                    (org-read-date))))
                        (concat "Painting " date))))
         p-def)
       ))
  :config
  (org-node-cache-mode)
  (org-node-seq-mode) 
  ;; (defun my/org-node-create-lit-note ()
  ;;   "Create a literature note with a citation key."
  ;;   (interactive)
  ;;   (let ((key (if (fboundp 'org-cite-read-key)
  ;;                  (org-cite-read-key)
  ;;                (read-string "Citekey (@key): ")))
  ;;         (title (read-string "Title: ")))
  ;;     (unless (string-prefix-p "@" key)
  ;;       (setq key (concat "@" key)))
  ;;     (org-node-create title (org-id-new))
  ;;     (org-node-add-refs key)))
  :general
  (tyrant-def
    "n"      (cons "node" (make-sparse-keymap))
    "nf" 'org-node-find
    "ni" 'org-node-insert-link
    "nb" 'org-node-context-dwim
    "nd" 'org-node-insert-into-related
    "ng" 'org-node-grep
;;    "nl" 'my/org-node-create-lit-note
    "nn" 'org-node-nodeify-entry
    "ns" 'org-node-seq-dispatch
    "nS" 'org-node-insert-transclusion-as-subtree
    "nw" 'org-node-refile
    "nr" 'org-node-visit-random
    "nt" 'org-node-insert-transclusion
    "nu" 'org-node-insert-raw-link
    )
  (despot-def (org-mode-map)
    :major-modes 'org-mode
    "n"      (cons "node" (make-sparse-keymap))
    "nf" 'org-node-find
    "ni" 'org-node-insert-link
    "nb" 'org-node-context-dwim
    "nd" 'org-node-insert-into-related
    "ng" 'org-node-grep
    "nn" 'org-node-nodeify-entry
    "ns" 'org-node-seq-dispatch
    "nS" 'org-node-insert-transclusion-as-subtree
    "nw" 'org-node-refile
    "nr" 'org-node-visit-random
    "nt" 'org-node-insert-transclusion
    "nu" 'org-node-insert-raw-link
    )
  )
#+end_src

*** Configure additional org exporters
:PROPERTIES:
:LAST_MODIFIED: [2025-08-08 Fri 17:13]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-additional-org-exporters
:END:

Not sure if there's a reason to use the bundled package =oer-reveal= if you
install reveal yourself using =npm= or similar. 

#+begin_src emacs-lisp
(use-package org-re-reveal
  :init (setq org-re-reveal-root "~/code/js-reveal")
  :general (despot-def org-mode-map
             "ee"    'org-export-dispatch
             "er"    'org-re-reveal-export-to-html
             "eR"   'org-re-reveal-export-to-html-and-browse
             "et"   'org-re-reveal-export-current-subtree
             )
  )

(use-package oer-reveal
  ;; bundle with org-re-reveal, reveal js, plugins
  :disabled)
#+end_src
*** Configuring org capture templates :TODO:
:PROPERTIES:
:CUSTOM_ID: configuring-org-capture-templates
:LAST_MODIFIED: [2025-07-19 Sat 04:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle no
(use-package doct)
#+end_src

*** Add additional ways to export from org to other formats
:PROPERTIES:
:CUSTOM_ID: add-additional-ways-to-export-from-org-to-other-formats
:LAST_MODIFIED: [2025-08-02 Sat 00:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package ox-pandoc
  :after org
  :hook (org-mode . org-pandoc-startup-check))

(use-package ob-mermaid
  :after org)
#+end_src

**** Disabled Exporters
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: disabled-exporters
:END:

#+begin_src emacs-lisp :tangle no
(use-package ox-tufte
	:disabled
	:after org
  )

(use-package ox-beamer-lecture
	:after org)
#+end_src
*** Configure org footer
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-org-footer
:END:

#+begin_src emacs-lisp :comments no :noweb no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-org.el ends here
#+end_src

** Configure (programming) language-specific modes and options
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 04:36]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-programming-language-specific-modes-and-options
:header-args: :tangle config/configure-prog-langs.el :comments noweb
:END:

#+name: Programming languages header
#+begin_src emacs-lisp :comments no
;;; configure-prog-langs.el --- lang-specific -*- lexical-binding: t -*-
;;; Commentary:
;; Configuration that's programming language specific
;; So LSP config doesn't live here
;;; Code:

#+end_src
*** Lisp-like languages
:PROPERTIES:
:CUSTOM_ID: lisp-like-languages
:LAST_MODIFIED: [2026-01-26 Mon 19:51]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp 
;;;; ========================= Lisp languages ==========================
(use-package slime
	:hook (elisp-mode . slime-mode)
  :config
	(setopt inferior-lisp-program "sbcl")
	(add-hook 'slime-mode-hook (setq-local lsp-bridge-mode -1))
  :general
  (despot-def (slime-mode-map)
    :major-modes 'slime-mode
    "b" 'slime-eval-buffer
    "c" 'slime-compile-defun
    "k" 'slime-compile-and-load-file
    "f"  'ad-Advice-slime-eval-defun
    "r" 'slime-eval-region
    )
  )

(use-package elisp-mode
  :ensure nil
  :config
  (despot-def :keymaps '(emacs-lisp-mode-map lisp-interaction-mode-map)
    "'"  'ielm
    "c"  (cons "compile" (make-sparse-keymap))
    "cc" 'emacs-lisp-byte-compile
    "e"  (cons "eval" (make-sparse-keymap))
    "eb" 'eval-buffer
    "ee" 'eval-last-sexp
    "er" 'eval-region
    "ef" 'eval-defun
    "t"  (cons "tests" (make-sparse-keymap))
    "tb" 'ert-run-tests-buffer
    "tq" 'ert)
  )

(use-package racket-mode
  :mode ("\\.rkt\\'" . racket-mode)
	)
#+end_src

*** Python configuration
:PROPERTIES:
:CUSTOM_ID: python-configuration
:LAST_MODIFIED: [2025-10-19 Sun 18:46]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp 
;;;; ============================== Python ==============================
(use-package uv-mode
  :hook (python-mode . uv-mode-auto-activate-hook)
  )
#+end_src

**** Disabled python packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 04:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: disabled-python-packages
:END:

Need time to figure these out but possible options for making Python more
interactive/enhance the REPL loop.

#+name: Python REPL/live coding 
#+begin_src emacs-lisp :tangle no :eval no :comments no
(use-package python-x)

(use-package live-py-mode
  :general (despot-def (python-mode-map)
             :major-modes '(python-mode python-ts-mode)
             "l" 'live-py-mode
             )
  )

(use-package code-cells
	:disabled
	:mode ("\\([ipynb]\\)\\'" . code-cells-mode))

(use-package drepl
	:disabled
	:general (trant-def "ci" 'drepl-ipython)
  )
#+end_src

#+begin_src emacs-lisp :tangle no :eval no :comments no
(use-package pyenv-mode
	:disabled)
#+end_src
