config/configure-org.el

;; [[file:../its-lit.org::#org-todoist][org-todoist:1]]
(use-package org-todoist
  :ensure (:host github
                 :repo "lillenne/org-todoist"
                 :branch "main"
                 )
  :init  (setq org-todoist-api-token (my/get-authinfo-token "api.todoist.com"))
  :config (setopt org-todoist-api-token (my/get-authinfo-token "api.todoist.com"))
  :general (tyrant-def "aT" 'org-todoist-dispatch)
  )
;; org-todoist:1 ends here

;; [[file:../its-lit.org::#configure-org-node][Configure Org-node:1]]
(use-package org-mem
  :defer
  :functions org-mem-updater
  :config
  (setopt org-mem-do-sync-with-org-id t
          org-mem-watch-dirs (list "~/obsidian/org/node")
          )
  (org-mem-updater-mode)
  )

(use-package org-node
  :init
  (setq org-node-seq-defs
        (list
       ;; All notes in creation order, 
       ;; according to the timestamps in their :CREATED: property.
       (org-node-seq-def-on-any-sort-by-property
        "a" "All notes by property :CREATED:" "CREATED")
       
        (org-node-seq-def-on-filepath-sort-by-basename
          "d" "Dailies" "~/obsidian/org/node/daily/" nil t)
         (org-node-seq-def-on-filepath-sort-by-basename
          "m" "Meetings" "~/obsidian/org/node/meetings/" nil t)
         (org-node-seq-def-on-filepath-sort-by-basename
          "p" "Painting log" "~/obsidian/org/node/painting-log/" nil t)
         ))
  :config
  (org-node-cache-mode)
  (org-node-seq-mode)

  :general
  (tyrant-def
    "n"      (cons "node" (make-sparse-keymap))
    "nf" 'org-node-find
    "ni" 'org-node-insert-link
    "nb" 'org-node-context-dwim
    "nd" 'org-node-insert-into-related
    "ng" 'org-node-grep
    "nn" 'org-node-nodeify-entry
    "ns" 'org-node-seq-dispatch
    "nS" 'org-node-insert-transclusion-as-subtree
    "nw" 'org-node-refile
    "nr" 'org-node-visit-random
    "nt" 'org-node-insert-transclusion
    "nu" 'org-node-insert-raw-link
    )
  (despot-def (org-mode-map)
    :major-modes 'org-mode
    "n"      (cons "node" (make-sparse-keymap))
    "nf" 'org-node-find
    "ni" 'org-node-insert-link
    "nb" 'org-node-context-dwim
    "nd" 'org-node-insert-into-related
    "ng" 'org-node-grep
    "nn" 'org-node-nodeify-entry
    "ns" 'org-node-seq-dispatch
    "nS" 'org-node-insert-transclusion-as-subtree
    "nw" 'org-node-refile
    "nr" 'org-node-visit-random
    "nt" 'org-node-insert-transclusion
    "nu" 'org-node-insert-raw-link
    )
  )
;; Configure Org-node:1 ends here

;; [[file:../its-lit.org::#configure-additional-org-exporters][Configure additional org exporters:1]]
(use-package org-re-reveal
  :init (setq org-re-reveal-root "~/code/js-reveal")
  :general (despot-def org-mode-map
             "ee"    'org-export-dispatch
             "er"    'org-re-reveal-export-to-html
             "eR"   'org-re-reveal-export-to-html-and-browse
             "et"   'org-re-reveal-export-current-subtree
             )
  )

(use-package oer-reveal
  ;; bundle with org-re-reveal, reveal js, plugins
  :disabled)
;; Configure additional org exporters:1 ends here

;; [[file:../its-lit.org::#add-additional-ways-to-export-from-org-to-other-formats][Add additional ways to export from org to other formats:1]]
(use-package ox-pandoc
  :after org
  :hook (org-mode . org-pandoc-startup-check))

(use-package ob-mermaid
  :after org)
;; Add additional ways to export from org to other formats:1 ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-org.el ends here
