config/configure-prog-langs.el
;;; configure-prog-langs.el --- lang-specific -*- lexical-binding: t -*-
;;; Commentary:
;; Configuration that's programming language specific
;; So LSP config doesn't live here
;;; Code:

;; [[file:../its-lit.org::#lisp-based-languages][Lisp-based languages:1]]
;;;; ========================= Lisp languages ==========================
(use-package slime
	:hook (elisp-mode . slime-mode)
  :config
	(setopt inferior-lisp-program "sbcl")
	(add-hook 'slime-mode-hook (setq-local lsp-bridge-mode -1))
  :general
  (despot-def (slime-mode-map)
    :major-modes 'slime-mode
    "b" 'slime-eval-buffer
    "c" 'slime-compile-defun
    "k" 'slime-compile-and-load-file
    "f"  'ad-Advice-slime-eval-defun
    "r" 'slime-eval-region
    )
  )

(use-package elisp-mode
  :ensure nil
  :config
  (despot-def :keymaps '(emacs-lisp-mode-map lisp-interaction-mode-map)
    "'"  'ielm
    "c"  (cons "compile" (make-sparse-keymap))
    "cc" 'emacs-lisp-byte-compile
    "e"  (cons "eval" (make-sparse-keymap))
    "eb" 'eval-buffer
    "ee" 'eval-last-sexp
    "er" 'eval-region
    "ef" 'eval-defun
    "t"  (cons "tests" (make-sparse-keymap))
    "tb" 'ert-run-tests-buffer
    "tq" 'ert)
  )

(use-package racket-mode
  :mode ("\\.rkt\\'" . racket-mode)
	)
;; Lisp-based languages:1 ends here

;; [[file:../its-lit.org::#python-configuration][Python configuration:1]]
;;;; ============================== Python ==============================
(use-package uv-mode
	:hook (python-mode . uv-mode)
  )
;; Python configuration:1 ends here

;; [[file:../its-lit.org::#r-programming][R programming:1]]
(use-package ess
  :mode ("\\.[rR]\\'" . R-mode)
  :init
