its-lit.org
*** Preserve appearance of collapsed outline headings until window edge
:PROPERTIES:
:LAST_MODIFIED: [2025-07-20 Sun 02:58]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: preserve-appearance-of-collapsed-outline-headings-until-window-edge
:END:

#+begin_src emacs-lisp
(use-package backline
  :after outline
  :config (advice-add 'outline-flag-region :after 'backline-update))

(use-package outline-minor-faces
  :after outline
  :config (add-hook 'outline-minor-mode-hook
                    #'outline-minor-faces-mode))
#+end_src
*** Color theme packages
:PROPERTIES:
:CUSTOM_ID: color-theme-packages
:LAST_MODIFIED: [2026-02-01 Sun 16:07]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

- Keep an eye on Catpppuccin, in the past it was weirdly slow to load. Like a
  substantial part of my startup time level of weirdly slow.
  
#+begin_src emacs-lisp
(use-package doom-themes)

(use-package ef-themes
  :config (setopt ef-themes-mixed-fonts t
                  ef-themes-variable-pitch-ui t)
  ;; wonder why this is fine but modus-themes gets angry if you try setopt instead of setq
  )

(use-package flexoki-themes
  :custom
  (flexoki-themes-use-bold-keywords t)
  (flexoki-themes-use-bold-builtins t)
  (flexoki-themes-use-italic-comments nil)
  )

;; Development version I think? Also built in
(use-package modus-themes
  :config
  ;; setopt will cause an error unless an :after or an autoload e.g. a hook or  is configured because these variables don't exist until load theme is called? something like that. setq is safe. :after org (this was arbitrary I just knew it was configured to autoload when opening an org file) + setopt worked fine
  ;; (setopt modus-themes-mixed-fonts t
  ;;       modus-themes-variable-pitch-ui t)

  (setq modus-themes-mixed-fonts t
        modus-themes-variable-pitch-ui t)

  ;; Maybe define some palette overrides, such as by using our presets
  ;; (setq modus-themes-common-palette-overrides
  ;;       modus-themes-preset-overrides-intense)
  )

(use-package catppuccin-theme)

#+end_src

**** Disabled themes
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 21:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header_args:emacs-lisp: :tange no :noweb no :comments no
:CUSTOM_ID: disabled-themes
:END:

***** Just not using at the moment
:PROPERTIES:
:LAST_MODIFIED: [2025-08-03 Sun 18:07]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: just-not-using-at-the-moment
:END:
Doric themes are nearly monochrome

Unspecified is really a theme that removes all faces. 
evenok's design involves sequentially loading themes to add more customization
which doesn't play nicely with my hook to disable themes on loading a new one.

#+name: nice just not using currently
#+begin_src emacs-lisp :tangle no
(use-package doric-themes)

(use-package nordic-night-theme)

;; unsets everything
(use-package unspecified-theme
  :general (tyrant-def ",u" '(load-theme unspecified t))
  )
;; Wants to unload themeing with a special "unspecified" theme instead of using
;; (disable-theme)
(use-package evenok
  :disabled
  :config
;; author recommended command wrapped up in a defun
  (defun evenok-load-theme ()
    "Load evenok theme after loading unspecified to reset themeing."
    (interactive)
    (mapcar #'load-theme
       '(unspecified
         evenok-dark
         ;; evenok-dark-extra ;; optional, very opinionated
         ))
    )
;; idiomatic alternative (only unloads top theme, mapcar for all)  
    (defun evenok-idiomatic-load-theme ()
    "Disable the current theme and load the evenok theme."
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'evenok-dark t)
    )

  )
#+end_src

***** Disabled for a reason
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 21:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: disabled-for-a-reason
:END:
- Kaolin is okay but I found the color choices to not be the most readable

#+begin_src emacs-lisp :tangle no
(use-package kaolin-themes)
#+end_src

#+name: Disabled due to doom redundancy
#+begin_src emacs-lisp :tangle no
(use-package gruvbox-theme)

(use-package solarized-theme
  :disabled)
#+end_src
