config/configure-theming.el
;;; configure-theming.el --- Themes configuration -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:

;; [[file:../its-lit.org::#preserve-appearance-of-collapsed-outline-headings-until-window-edge][Preserve appearance of collapsed outline headings until window edge:1]]
(use-package backline
  :after outline
  :config (advice-add 'outline-flag-region :after 'backline-update))

(use-package outline-minor-faces
  :after outline
  :config (add-hook 'outline-minor-mode-hook
                    #'outline-minor-faces-mode))
;; Preserve appearance of collapsed outline headings until window edge:1 ends here

;; [[file:../its-lit.org::#color-theme-packages][Color theme packages:1]]
(use-package doom-themes)

(use-package ef-themes
  :config (setopt ef-themes-mixed-fonts t
                  ef-themes-variable-pitch-ui t)
  ;; wonder why this is fine but modus-themes gets angry if you try setopt instead of setq
  )

(use-package flexoki-themes
  :custom
  (flexoki-themes-use-bold-keywords t)
  (flexoki-themes-use-bold-builtins t)
  (flexoki-themes-use-italic-comments nil)
  )

;; Development version I think? Also built in
(use-package modus-themes
  :config
  ;; setopt will cause an error unless an :after or an autoload e.g. a hook or  is configured because these variables don't exist until load theme is called? something like that. setq is safe. :after org (this was arbitrary I just knew it was configured to autoload when opening an org file) + setopt worked fine
  ;; (setopt modus-themes-mixed-fonts t
  ;;       modus-themes-variable-pitch-ui t)

  (setq modus-themes-mixed-fonts t
        modus-themes-variable-pitch-ui t)

  ;; Maybe define some palette overrides, such as by using our presets
  ;; (setq modus-themes-common-palette-overrides
  ;;       modus-themes-preset-overrides-intense)
  )
;; Color theme packages:1 ends here
