its-lit.org
*** Managing fonts
:PROPERTIES:
:CUSTOM_ID: managing-fonts
:LAST_MODIFIED: [2025-07-19 Sat 19:49]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp
;;;; Font configuration
(use-package fontaine
  :hook (elpaca-after-init . fontaine-mode)
  :config
  (setopt fontaine-presets '(
                             (t  :default-weight normal
                                 :default-height 150
                                 :fixed-pitch-family "JetBrains Mono NL"
                                 :variable-pitch-family "Heliotrope OT"
                                 :variable-pitch-height 1.05
                                 :bold-family nil ; use the face's bold
                                 :bold-weight bold)

;;;;; Presets that keep the same font family but modify its appearance
	                           ;; Presets to change point size only
	                           (10pt :default-height 100)
	                           (11pt :default-height 110)
	                           (12pt :default-height 120)
	                           (13pt :default-height 130)
	                           (14pt :default-height 140)
	                           (15pt :default-height 150)
	                           (16pt :default-height 160)
	                           (17pt :default-height 170)
	                           (18pt :default-height 180)

;; Line spacing is additional line spacing, not total line spacing
;; (i.e. 0 is the default)
;; Meaning differs depending on whether it is an integer or float
;; Integer = additional pixels to add
;; Floating point = additional spacing proportional to point size
	                           (lsd :line-space 0)
	                           ;; line spacing pixels
	                           (lsp1 :line-spacing 1)
	                           (lsp2 :line-spacing 2)
	                           (lsp3 :line-spacing 3)
	                           (lsp4 :line-spacing 4)
	                           (lsp5 :line-spacing 5)
	                           ;; line spacing scaling
	                           (lss05 :line-spacing 0.05)
	                           (lss10 :line-spacing 0.10)
	                           (lss15 :line-spacing 0.15)
	                           (lss20 :line-spacing 0.20)
	                           (lss25 :line-spacing 0.25)
	                           (lss30 :line-spacing 0.30)

;;;;; Font presets

;;;;;; Monospace fonts
	                           (iosevka-comfy
	                            :default-family "Iosevka Comfy"
	                            :default-weight normal)

	                           (fira-mono
	                            :default-family "Fira Mono")

	                           (fira-code
	                            :default-family "FiraCode Nerd Font"
	                            )

	                           (jetbrains-mono
	                            :default-family "JetBrains Mono NL")

	                           (plex-mono
	                            :default-family "IBM Plex Mono")

	                           (dank-mono
	                            :default-family "Dank Mono")

	                           (hack
	                            :default-family "Hack Nerd Font")

	                           ;; think inter is proportional not mono
	                           (inter
	                            :default-family "Inter")

	                           (xenon
	                            :default-family "Monaspace Xenon")

	                           (input-mono
	                            :default-family "Input Mono")
;;;;;; Quasi-monospace fonts
	                           (duospace
	                            :default-family "iA Writer Duospace")

	                           (triplicate-mono-b
	                            :default-family "Triplicate B")

	                           (triplicate-code-b
	                            :default-family "Triplicate B Code")

	                           (triplicate-poly-b
	                            :default-family "Triplicate B Poly")

	                           (triplicate-mono-a
	                            :default-family "Triplicate A")

	                           (triplicate-code-a
	                            :default-family "Triplicate A Code")

	                           (triplicate-poly-a
	                            :default-family "Triplicate A Poly")

	                           (header-triplicate
	                            :header-line-family "Triplicate A Caps"
	                            :header-line-height 1.1)

	                           (triplicate-combo
	                            :default-family "Triplicate A Code"
	                            :variable-pitch-family "Triplicate A Poly"
	                            :header-line-family "Triplicate A Caps"
	                            :header-line-height 1.1
	                            )

                             ;; Not fully variable width but it's not suitable for coding imo.
                             ;; Could be fine for writing in a markup language
                             (quattro
	                            :default-family "iA Writer Quattro V")


;;;;;; Header fonts      
	                           (header-heliotrope
	                            :header-line-family "Heliotrope 4 Caps"
	                            :header-line-height 1.1)

	                           (header-overpass
	                            :header-line-family "Overpass"
	                            :header-line-height 1.1)

                             ;; Don't use a different family for headers 
	                           (header-null
	                            :header-line-family nil
	                            :header-line-height 1.0)

;;;;;; Variable pitch fonts
	                           (serif-input
	                            :variable-pitch-family "Input Serif")

	                           (sans-input
	                            :variable-pitch-family "Input Sans")

	                           (vp-heliotrope
	                            :variable-pitch-family "Heliotrope OT"
	                            :variable-pitch-height 1.05)

	                           (vp-avenir
	                            :variable-pitch-family "Avenir"
	                            :default-weight book)

	                           (vp-minion
	                            :variable-pitch-family "Minion 3")
	                           )
	        )
  :custom (fontaine-mode t)
  )
#+end_src

**** View fonts within emacs
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:38]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: view-fonts-within-emacs
:END:

Font waterfall and size viewer from within emacs.
#+begin_src emacs-lisp
(use-package show-font
  :general  (tyrant-def  "hs" 'show-font-select-preview
                         "hT" 'show-font-tabulated
                         )
  :bind
  (("C-c s f" . show-font-select-preview)
   ("C-c s t" . show-font-tabulated))
  )

#+end_src
**** Disabled packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:38]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: disabled-packages
:END:

#+begin_src emacs-lisp :tangle no
(use-package ligature
  :disabled)
#+end_src
*** Theming advice and hooks
:PROPERTIES:
:LAST_MODIFIED: [2025-08-03 Sun 19:35]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: theming-advice-and-hooks
:END:

#+begin_src emacs-lisp
(advice-add 'load-theme :after #'load-theme@run-hooks)
(advice-add 'load-theme :before #'load-theme@theme-dont-propagate)

;; (add-hook 'after-load-theme-hook #'bolder-faces)
;; (add-hook 'after-load-theme-hook #'customize-tab-bar)
;; (add-hook 'after-load-theme-hook #'unscale-outlines)
(add-hook 'after-load-theme-hook #'my-disable-flymake-underline)
#+end_src

*** Theming lisp footer
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:36]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: theming-lisp-footer
:END:

#+begin_src emacs-lisp
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-theming.el ends here
#+end_src

** Configure completion frameworks
:PROPERTIES:
:CUSTOM_ID: configure-completion-frameworks
:LAST_MODIFIED: [2025-07-19 Sat 20:37]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
