its-lit.org
** setup-font-locking.el
:PROPERTIES:
:CUSTOM_ID: setup-font-lockingel
:LAST_MODIFIED: [2025-08-03 Sun 20:30]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-font-locking.el
;;; config/setup-font-locking.el --- Font locking configuration -*- lexical-binding: t -*-

(use-package hl-todo
  :custom (global-hl-todo-mode 't))

(use-package morlock
  :hook emacs-lisp-mode)

(use-package highlight-parentheses
  :hook ((org-mode prog-mode) . highlight-parentheses-mode)
  
  :config
  (defun my-hl-paren-get-theme-colors ()
    "Return a list of colors for highlight-parentheses from the current theme."
    (list
     (face-attribute 'font-lock-keyword-face :foreground nil 'default)
     (face-attribute 'font-lock-function-name-face :foreground nil 'default)
     (face-attribute 'font-lock-string-face :foreground nil 'default)
     (face-attribute 'font-lock-comment-face :foreground nil 'default)))

 ;; (setq highlight-parentheses-colors (function my-hl-paren-get-theme-colors))

;;  (setq highlight-parentheses-attributes '(weight ultra-bold))

  (setopt highlight-parentheses-delay 0.05)
  
  (set-face-attribute 'highlight-parentheses-highlight nil :weight 'ultra-bold)
  )

(use-package rainbow-delimiters
	:disabled
  :hook (prog-mode . rainbow-delimiters-mode))



(use-package paren-face
	;; https://github.com/tarsius/paren-face
	;; Parentheses dimming
	;;	:hook (elisp-mode . paren-face-mode)
  
	:config
  (add-to-list 'paren-face-modes '(r-mode R-mode ess-r-mode))
  (global-paren-face-mode t)
	)

;;;
;; --- Font Locking Utilities ---
;;;

(use-package font-lock-studio
  ;; really useful when you need it, but doesn't need to be enabled most of the time
  :disabled)

(use-package highlight-refontification
  ;; really useful when you need it, but doesn't need to be enabled most of the time
  :disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-font-locking.el ends here
#+end_src

** setup-go.el
:PROPERTIES:
:CUSTOM_ID: setup-goel
:LAST_MODIFIED: [2025-08-10 Sun 17:55]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-go.el
;;; config/setup-go.el --- Go programming language configuration -*- lexical-binding: t -*-

(use-package go-mode
  :mode ("\\.go\\'" . go-mode)
  :general
  (despot-def (go-mode-map)
    :major-modes '(go-mode go-ts-mode)
    "a" 'gofmt
    "f" (cons "jump" (make-sparse-keymap))
    "fa" 'go-goto-arguments
    "ff" 'go-goto-function
    "fn" 'go-goto-function-name
    "fr" 'go-goto-return-values
    "fm" 'go-goto-method-receiver
    )
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-go.el ends here
#+end_src

** setup-gopher.el
:PROPERTIES:
:CUSTOM_ID: setup-gopherel
:END:
#+begin_src emacs-lisp :tangle config/setup-gopher.el
;;; config/setup-gopher.el --- Gopher configuration -*- lexical-binding: t -*-

(use-package elpher
	:general
	(despot-def "ag" 'elpher))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-gopher.el ends here
#+end_src
** setup-icons.el
:PROPERTIES:
:CUSTOM_ID: setup-iconsel
:END:
#+begin_src emacs-lisp :tangle config/setup-icons.el
;;; config/setup-icons.el --- Icons configuration -*- lexical-binding: t -*-

(use-package nerd-icons-dired
  :hook  (dired-mode . nerd-icons-dired-mode)
  )

(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode)
	:config
	(setopt
	 nerd-icons-ibuffer-icon t ; Whether display the icons.
	 nerd-icons-ibuffer-color-icon t ; Whether display the colorful icons.
	 ;; It respects `nerd-icons-color-icons'.
	 nerd-icons-ibuffer-icon-size 1.0
	 ;; The default icon size in ibuffer.
	 nerd-icons-ibuffer-human-readable-size t ; Use human readable file size in ibuffer.
	 ;; A list of ways to display buffer lines with `nerd-icons'.
	 ;; See `ibuffer-formats' for details.
	 ;; nerd-icons-ibuffer-formats

	 ;; Slow Rendering
	 ;; If you experience a slow down in performance when rendering multiple icons simultaneously,
	 ;; you can try setting the following variable
	 inhibit-compacting-font-caches t)
	)


(use-package tab-line-nerd-icons
	:hook (tab-line-mode . tab-line-nerd-icons-global-mode))

(use-package nerd-icons-corfu
	:disabled
;;	:if (global-corfu-mode) ; not defined if corfu isn't on. Need to figure out how to safely try this or an alternative condition
	:after corfu
	:init
	(add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
;;	:hook (corfu-mode . nerd-icons-completion)
;; ;; Optionally:
;; (setq nerd-icons-corfu-mapping
;;       '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
;;         (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
;;         ;; ...
;;         (t :style "cod" :icon "code" :face font-lock-warning-face)))
;;         ;; Remember to add an entry for `t', the library uses that as default.
;; The Custom interface is also supported for tuning the variable above.
	)

(use-package all-the-icons
	:disabled
  :if (display-graphic-p))

(use-package all-the-icons-dired
	:disabled
  :after all-the-icons
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package all-the-icons-ibuffer
	:disabled
  :after all-the-icons
  :hook (ibuffer-mode . all-the-icons-ibuffer-mode))

(use-package kind-icon
	:disabled
  :after corfu
  :custom
   (kind-icon-blend-background t)
   (kind-icon-default-face 'corfu-default) ; only needed with blend-background
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package nerd-icons
	;;	:hook (doom-modeline-mode)
	:custom (nerd-icon-scale-factor 0.8)
)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-icons.el ends here
#+end_src

** setup-llm.el
:PROPERTIES:
:CUSTOM_ID: setup-llmel
:LAST_MODIFIED: [2026-01-08 Thu 21:55]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Customize =mcp-server-lib= to use =no-littering='s directory otherwise it defaults
to installing its helper script to the root of the emacs user directory.

:PROPERTIES:
:CUSTOM_ID: setup-llmel
:LAST_MODIFIED: [2025-08-10 Sun 18:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-llm.el
;;; config/setup-llm.el --- LLM configuration -*- lexical-binding: t -*-

(use-package gptel
  :functions gptel--insert-file-string
  :config (setopt gptel-model   'llama-cpp
                  gptel-backend (gptel-make-openai "llama-cpp"
                                  :stream t
                                  :protocol "http"
                                  :host "localhost:1234"
                                  :models '(llama-cpp))
                  )

  (gptel-make-openai "OpenAI"
    :stream t
    :key (gptel-api-key-from-auth-source "api.openai.com" "apikey"))
  (gptel-make-openai "OpenRouter"               
    :host "openrouter.ai"
    :endpoint "/api/v1/chat/completions"
    :stream t
    :key (gptel-api-key-from-auth-source "api.openrouter.ai" "apikey")
    :models '(google/gemini-3.0-flash
	            google/gemini-3.0-pro
              openrouter/auto
              )
    )

  (gptel-make-anthropic "Claude"          
    :stream t
    :key (gptel-api-key-from-auth-source "api.anthropic.com" "apikey")
    )

  (gptel-make-gemini "Gemini-API"
    :stream t
    :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com" "apikey")
    )
  
  :general (tyrant-def "aG" 'gptel-menu)
  
  )

(use-package mcp-server-lib
  :after no-littering
  :custom (mcp-server-lib-install-directory 'no-littering-var-directory)
  )

(use-package elisp-dev-mcp
  :after mcp-server-lib)

(use-package chatgpt-shell
  :config
  (setopt chatgpt-shell-openai-key (getenv "OPENAI_API_KEY")
          chatgpt-shell-anthropic-key (getenv "ANTHROPIC_API_KEY")
          )
  :general (tyrant-def "as" 'chatgpt-shell-transient)
  )

(use-package agent-shell
  :config
  (setopt
   agent-shell-anthropic-claude-environment        (agent-shell-make-environment-variables :inherit-env t)
   agent-shell-anthropic-authentication          (agent-shell-anthropic-make-authentication :login t)
   )
  agent-shell-preferred-agent-config (agent-shell-anthropic-make-claude-code-config)
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-llm.el ends here
#+end_src
*** LLM unused config
:PROPERTIES:
:LAST_MODIFIED: [2026-01-08 Thu 17:27]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: llm-unused-config
:END:

No need to depend on =llm= explicitly. Ellama is complementary to gptel I just haven't used it for a while.

#+begin_src emacs-lisp :tangle no :eval no :comments no
(use-package llm
  :config
  (use-package llm-openai
    :ensure nil)

  (use-package llm-claude
    :ensure nil)
  )

(use-package ellama
  :disabled
  :after llm
  :config
  (setopt ellama-provider (make-llm-openai-compatible
			   :url "http://127.0.0.1:1234"))
  )

(use-package forge-llm
  :disabled
  :after forge llm
  :custom
  (forge-llm-llm-provider
   (make-llm-claude
    :key (auth-source-pick-first-password
	  :host "api.anthropic.com"
	  :user "apikey")
    :chat-model "claude-3-7-sonnet-20250219"
    )
   )
  :config
  (forge-llm-setup)
  :general
  (tyrant-def
    "gg" 'forge-llm-generate-pr-description
    "gp" 'forge-llm-generate-pr-description-at-point
    "gt" 'forge-llm-insert-template-at-point
    )
  )

(use-package aidermacs
  :disabled
  :after gptel
  :config
  (setopt aidermacs-backend 'vterm)
  (setenv "GEMINI_API_KEY" (gptel-api-key-from-auth-source "generativelanguage.googleapis.com" "apikey"))
  (setenv "ANTHROPIC_API_KEY" (gptel-api-key-from-auth-source "api.anthropic.com" "apikey"))
  (setenv "OPENROUTER_API_KEY" (gptel-api-key-from-auth-source "api.openrouter.ai" "apikey"))
  (setenv "OPENAI_API_KEY" (gptel-api-key-from-auth-source "api.openai.com" "apikey"))
  (setenv "LM_STUDIO_API_KEY" "dummy-api-key")
  (setenv "LM_STUDIO_API_BASE" "http://localhost:1234/v1") 

  :custom  (aidermacs-default-model "gemini/gemini-pro-3.0")

  :general (tyrant-def "aa" 'aidermacs-transient-menu)
  )
#+end_src

** Configure programming tools (language agnostic or multi-language)
:PROPERTIES:
:header-args: :tangle config/configure-prog-tools.el :comments noweb
:CUSTOM_ID: configure-programming-tools-language-agnostic-or-multi-language
:LAST_MODIFIED: [2025-07-31 Thu 16:59]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+name: header for programming tools
#+begin_src emacs-lisp :comments no
;;; configure-prog-tools.el --- programming add-ons -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

*** Language server (lsp-bridge)
:PROPERTIES:
:CUSTOM_ID: language-server-lsp-bridge
:LAST_MODIFIED: [2026-02-03 Tue 02:20]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no
;;;; ========================= Language Server packages ========================
#+end_src

#+name: lsp-bridge block
#+begin_src emacs-lisp
(use-package lsp-bridge
  :after yasnippet

  :ensure (lsp-bridge :type git
                      :host github
                      :repo "manateelazycat/lsp-bridge"
                      :files (:defaults "*.el" "*.py" "acm" "core" "langserver"
                                        "multiserver" "resources")
                      :build (:not elpaca--byte-compile)
                      )

  :config  (setopt toml-indent-offset 2
                   lsp-bridge-enable-hover-diagnostic t
                   lsp-bridge-enable-org-babel nil
                   acm-enable-preview t
                   )
  (evil-set-initial-state 'lsp-bridge-ref-mode 'emacs)

  :general  (tyrant-def "l" (cons "lsp" (make-sparse-keymap))
              "lf" 'lsp-bridge-find-def
              "lF" 'lsp-bridge-find-def-other-window
              "lh" 'lsp-bridge-show-documentation
              "ld" 'lsp-bridge-popup-documentation
              "lp" 'lsp-bridge-peek
              "lP" 'lsp-bridge-peek-abort
              )
  )

(add-hook 'elpaca-after-init-hook #'global-lsp-bridge-mode)
#+end_src

