its-lit.org
**** Lsp Bridge Command reference
:PROPERTIES:
:CUSTOM_ID: lsp-bridge-command-reference
:LAST_MODIFIED: [2025-07-20 Sun 21:01]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:


- lsp-bridge-find-def: jump to the definition
- lsp-bridge-find-def-other-window: jump to the definition in other-window
- lsp-bridge-find-def-return: return to the location before calling lsp-bridge-find-def
- lsp-bridge-find-type-def: Jump to the position of type definition.
  lsp-bridge-find-type-def-other-window: Jump to the position of type definition in another window.
- lsp-bridge-find-impl: jump to the implementation
- lsp-bridge-find-impl-other-window: jump to the implementation in other-window
- lsp-bridge-find-references: traverse across code references (forked from color-rg.el)
- lsp-bridge-popup-documentation: lookup documentation of symbol under the cursor
- lsp-bridge-popup-documentation-scroll-up: scroll up popup document.
- lsp-bridge-popup-documentation-scroll-down: scroll down popup document.
- lsp-bridge-show-documentation: lookup documentation of symbol under the cursor, but using a buffer instead
- lsp-bridge-rename: rename symbol under the cursor
- lsp-bridge-diagnostic-jump-next: Jump to the next diagnostic position
- lsp-bridge-diagnostic-jump-prev: Jump to the previous diagnostic position
- lsp-bridge-diagnostic-list: List all diagnostic information
- lsp-bridge-diagnostic-copy: Copy the current diagnostic information to the clipboard
- lsp-bridge-code-action: Popup code action menu, you can pass special actin-kind to fix, action-kind can use one of "quickfix", "refactor", "refactor.extract", "refactor.inline", "refactor.rewrite", "source", "source.organizeImports", "source.fixAll"
- lsp-bridge-workspace-list-symbol-at-point: Finds the definition of a symbol at the cursor point
- lsp-bridge-workspace-list-symbols: List all symbols in workspace and jump to the symbol definition
- lsp-bridge-signature-help-fetch: show signature help in minibuffer manually (move cursor to parameters area will show signature help automatically)
- lsp-bridge-popup-complete-menu: Manually popup the completion menu, you only need this command when turn on option lsp-bridge-complete-manually
- lsp-bridge-restart-process: restart lsp-bridge process (only used for development)
- lsp-bridge-toggle-sdcv-helper: Switch dictionary completion assistant
- lsp-bridge-peek-abort: Close peek window (default binding to C-g)
- lsp-bridge-peek-list-next-line: Select the next definition or reference (default binding to M-S-n)
- lsp-bridge-peek-list-prev-line: Select the previous definition or reference (default binding to M-S-p)
- lsp-bridge-peek-file-content-next-line: Scroll down one line in the peek window file content (default binding to M-n)
- lsp-bridge-peek-file-content-prev-line: Scroll up one line in the peek window file content (default binding to M-p)
- lsp-bridge-peek-jump: Jump to the location of the definition or reference (default binding to M-l j)
- lsp-bridge-peek-jump-back: Jump back to the original position (default bound to M-l b)
- lsp-bridge-peek-through: View one symbol in the peek window
- lsp-bridge-peek-tree-previous-branch: Select the previous branch at the same level in the browsing history (default binding to <up>)
- lsp-bridge-peek-tree-next-branch: Select the next branch at the same level in the browsing history (default binding to <down>)
- lsp-bridge-peek-tree-previous-node: Select the previous higher-level node in the browsing history (default binding to <left>)
- lsp-bridge-peek-tree-next-node: Select the next lower-level node in the browsing history (default binding to <right>)
- lsp-bridge-indent-left: Indents the pasted text to the left according to the indent values defined in lsp-bridge-formatting-indent-alist
- lsp-bridge-indent-right: Indents the pasted text to the right according to the indent values defined in lsp-bridge-formatting-indent-alist
- lsp-bridge-semantic-tokens-mode: Enables or disables semantic token highlighting, please ref to Semantic Tokens Wiki


*** Unicode input
:PROPERTIES:
:CUSTOM_ID: unicode-input
:LAST_MODIFIED: [2026-01-08 Thu 22:13]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

For inserting unicode math characters e.g. for Lean programming. This is
distinct from any TeX typesetting.

#+begin_src emacs-lisp
(use-package unicode-math-input
  :general (tyrant-def "K" 'unicode-math-input)
  )
#+end_src
*** Code formatting
:PROPERTIES:
:CUSTOM_ID: code-formatting
:LAST_MODIFIED: [2025-07-31 Thu 18:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package apheleia
  :config
  (add-to-list 'apheleia-formatters '(air . ("air" "format" filepath)))
  (add-to-list 'apheleia-mode-alist '(ess-r-mode . air))
  (apheleia-global-mode +1)
  )
#+end_src

**** Removed code formatters
:PROPERTIES:
:CUSTOM_ID: removed-code-formatters
:LAST_MODIFIED: [2025-07-31 Thu 18:43]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :eval no :tangle no :comments no
(use-package editorconfig
  :config  (editorconfig-mode nil)
	:general (tyrant-def "ce" 'editorconfig-mode)
	)
#+end_src


*** Footer for configure programming tools
:PROPERTIES:
:CUSTOM_ID: footer-for-configure-programming-tools
:END:

#+name: footer for programming tools
#+begin_src emacs-lisp :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-prog-tools.el ends here
#+end_src
** setup-lsp.el
:PROPERTIES:
:CUSTOM_ID: setup-lspel
:END:
#+begin_src emacs-lisp :tangle config/setup-lsp.el
;;; config/setup-lsp.el --- LSP configuration -*- lexical-binding: t -*-

(use-package eglot
	:disabled
;  :commands expand-absolute-name
  :init
  (setq read-process-output-max (* 1024 1024))

  ;; (defun expand-absolute-name (name)
  ;;   (if (file-name-absolute-p name)
  ;;       (tramp-file-local-name
  ;;        (expand-file-name
  ;;         (concat (file-remote-p default-directory) name)))
  ;;     name))

  (general-def eglot--managed-mode
    :states '(normal insert motion emacs)
    :keymaps 'override
    :prefix-map 'tyrant-eglot-map
    :definer 'minor-mode
    :prefix "SPC"
    :non-normal-prefix "S-SPC"
    "ce"  (cons "eglot" (make-sparse-keymap))
    "cea" 'eglot-code-actions
    "ceb" 'eglot-events-buffer
    "cer" 'eglot-rename
    "ceR" 'eglot-reconnect
    "cex" 'eglot-shutdown
    "ceX" 'eglot-shutdown-all
    "ce=" 'eglot-format)
  :general
  (tyrant-def "cE" 'eglot))


(use-package consult-eglot
	:disabled
  :after eglot consult)

(use-package consult-eglot-embark
	:disabled
	:after consult eglot embark
  :hook ('eglot-ensure . consult-eglot-embark-mode))


(use-package eldoc-box
	:disabled ;slow, try again with lsp-bridge
  :hook (eglot-managed-mode . eldoc-box-hover-mode))

(use-package dape
	:disabled

	  :hook (dape-mode . repeat-mode)
  ;; Enable repeat mode for more ergonomic `dape' use
;;  :preface
  ;; By default dape shares the same keybinding prefix as `gud'
  ;; If you do not want to use any prefix, set it to nil.
  ;; (setq dape-key-prefix "\C-x\C-a")

;;  :hook
  ;; Save breakpoints on quit
  ;; (kill-emacs . dape-breakpoint-save)
  ;; Load breakpoints on startup
  ;; (after-init . dape-breakpoint-load)

  :config
  ;; Turn on global bindings for setting breakpoints with mouse
  ;; (dape-breakpoint-global-mode)

  ;; Info buffers to the right
  (setopt dape-buffer-window-arrangement 'right)

  ;; Info buffers like gud (gdb-mi)
  ;; (setq dape-buffer-window-arrangement 'gud)
  ;; (setq dape-info-hide-mode-line nil)

  ;; Pulse source line (performance hit)
  (add-hook 'dape-display-source-hook 'pulse-momentary-highlight-one-line)

  ;; Showing inlay hints
  ;; (setq dape-inlay-hints t)

  ;; Save buffers on startup, useful for interpreted languages
  (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

  ;; Kill compile buffer on build success
  ;; (add-hook 'dape-compile-hook 'kill-buffer)

  ;; Projectile users
  ;; (setq dape-cwd-function 'projectile-project-root)
)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-lsp.el ends here
#+end_src
** setup-media.el
:PROPERTIES:
:CUSTOM_ID: setup-mediael
:END:
#+begin_src emacs-lisp :tangle config/setup-media.el
;;; config/setup-media.el --- Media players configuration -*- lexical-binding: t -*-

(use-package ready-player
	:general
	(tyrant-def "ar" 'ready-player-view-player)
	:config
	(ready-player-mode +1)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-media.el ends here
#+end_src

** setup-modeline.el
:PROPERTIES:
:CUSTOM_ID: setup-modelineel
:END:
#+begin_src emacs-lisp :tangle config/setup-modeline.el
;;; config/setup-modeline.el --- Modeline configuration -*- lexical-binding: t -*-

(use-package doom-modeline
  :hook (elpaca-after-init . doom-modeline-mode)
  :config
  (setopt inhibit-compacting-font-caches t
          doom-modeline-buffer-encoding nil
          doom-modeline-height 0
          doom-modeline-buffer-file-name-style 'auto
          doom-modeline-project-detection 'project
          doom-modeline-icon t
          doom-modeline-major-mode-icon nil
          doom-modeline-modal-icon nil
          doom-modeline-gnus nil
          doom-modeline-irc nil
          doom-modeline-persp-name nil
          )
  )

(use-package moody
  :disabled
  :config
  (moody-replace-mode-line-front-space)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode)
  )

(use-package nano-modeline
  :disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-modeline.el ends here
#+end_src

** setup-notes.el
:PROPERTIES:
:CUSTOM_ID: setup-notesel
:END:
#+begin_src emacs-lisp :tangle config/setup-notes.el
;;; config/setup-notes.el --- Notes configuration -*- lexical-binding: t -*-

(use-package obsidian
  :config
	(setopt obsidian-directory "~/obsidian"
					obsidian-inbox-directory "Inbox"
					obsidian-daily-notes-directory "Notes/Time-based Notes/Daily Notes"
					obsidian-templates-directory "Resources/Templates"
					obsidian-daily-note-template "Resources/Templates/Daily Note Template"
					global-obsidian-mode t
					obsidian-backlinks-mode nil)

	:general
	(tyrant-def "aob" 'obsidian-toggle-backlinks-panel)
  )

(use-package annotate
	:disabled
	:general
	(tyrant-def "aa" 'annotate-mode)
	)

(use-package orgmdb
	:disabled
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-notes.el ends here
#+end_src

** setup-projects.el
:PROPERTIES:
:CUSTOM_ID: setup-projectsel
:LAST_MODIFIED: [2025-07-31 Thu 18:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-projects.el
;;; config/setup-projects.el --- Projects configuration -*- lexical-binding: t -*-

(use-package todoist
	:disabled
  :config
  (setq todoist-backing-buffer "~/obsidian/org/todoist")

  (despot-def todoist-mode-map
    "t"     'todoist-task-menu
    "p"     'todoist-project-menu
    "n"     'todoist-new-task
    "c"      'todoist-close-task
    "u"      'todoist-update-task
    "U"      'todoist-update-project)

  )

(use-package bookmark-in-project)

(use-package chronometrist)


(use-package disproject
  ;; Replace `project-prefix-map' with `disproject-dispatch'.
  :bind ( :map ctl-x-map
          ("p" . disproject-dispatch)))

(use-package perject
	:disabled)

(use-package perpsective
	:disabled)

(use-package projection
  :disabled
  ;; Enable the `projection-hook' feature.
  :hook (elpaca-after-init . global-projection-hook-mode)

  ;; Require projections immediately after project.el.
  :config
  (with-eval-after-load 'project
    (require 'projection))

  :config
  ;; Uncomment if you want to disable prompts for compile commands customized in .dir-locals.el
  ;; (put 'projection-commands-configure-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-build-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-test-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-run-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-package-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-install-project 'safe-local-variable #'stringp)

  ;; Access pre-configured projection commands from a keybinding of your choice.
  ;; Run `M-x describe-keymap projection-map` for a list of available commands.
  :bind-keymap
  ("C-x P" . projection-map))

(use-package projection-multi
  :disabled
  ;; Allow interactively selecting available compilation targets from the current
  ;; project type.
  :bind ( :map project-prefix-map
          ("RET" . projection-multi-compile)))

(use-package projection-multi-embark
  :disabled
  :after embark
  :after projection-multi
  ;; Add the projection set-command bindings to `compile-multi-embark-command-map'.
  :config (projection-multi-embark-setup-command-map))

(use-package tabspaces
  :after consult
  :hook (tab-bar-mode . tabspaces-mode) 
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))
  (tabspaces-initialize-project-with-todo t)
  (tabspaces-todo-file-name "project-todo.org")
  ;; sessions
  (tabspaces-session t)
  (tabspaces-session-auto-restore nil)
  (tab-bar-new-tab-choice "*scratch*")
	:config
	;; Filter Buffers for Consult-Buffer
	(with-eval-after-load 'consult
		;; hide full buffer list (still available with "b" prefix)
		(consult-customize consult--source-buffer :hidden t :default nil)
		;; set consult-workspace buffer list
		(add-to-list 'consult-buffer-sources 'consult--source-workspace)
		)

	(add-hook 'tabspaces-mode-hook #'my--consult-tabspaces)
	(setopt tabspaces-session-project-session-store "~/.emacs.d/var/tabspaces-sessions/")
  )

(use-package activities
  :disabled
	:init
  (activities-mode)
  (activities-tabs-mode)
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list))
	)

(use-package buffler
	:disabled
	)

(use-package perspective
	:disabled
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init
  (persp-mode))

(use-package burly
	:disabled
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-projects.el ends here
#+end_src

** setup-reading.el
:PROPERTIES:
:CUSTOM_ID: setup-readingel
:LAST_MODIFIED: [2026-01-03 Sat 02:29]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

