config/configure-prog-tools.el

;; [[file:../its-lit.org::#unicode-input][Unicode input:1]]
(use-package unicode-math-input
  :general (tyrant-def "K" 'unicode-math-input)
  )
;; Unicode input:1 ends here

;; [[file:../its-lit.org::#code-formatting][Code formatting:1]]
(use-package apheleia
  :config
  (add-to-list 'apheleia-formatters '(air . ("air" "format" filepath)))
  (add-to-list 'apheleia-mode-alist '(ess-r-mode . air))
  (apheleia-global-mode +1)
  )
;; Code formatting:1 ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-prog-tools.el ends here
