its-lit.org
*** TODO Fix pdf-tools post-build command
:PROPERTIES:
:LAST_MODIFIED: [2026-01-03 Sat 02:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: fix-pdf-tools-post-build-command
:END:
Figure out why the post-build command stopped working. Needed to delete the
package, reinstall it, and manually run =pdf-tools-install=

*** Reading package declarations
:PROPERTIES:
:CUSTOM_ID: reading-package-declarations
:END:
#+begin_src emacs-lisp :tangle config/setup-reading.el
;;; config/setup-reading.el --- Reading tools -*- lexical-binding: t -*-

(use-package djvu)

(use-package nov
	:mode ("\\.epub\\'" . nov-mode)
	:hook (nov-mode . visual-line-mode)
	:config
;; Want this only in nov-mode with variable pitch font, not the right way to do        
;;	(setq-local visual-fill-column-width 60)
        (setopt nov-text-width t
                visual-fill-column-center-text t)
        )

(use-package pdf-tools
;;  :ensure (:post-build (pdf-tools-install))
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :hook (pdf-view-mode . (lambda () (visual-fill-column-mode -1)))
  :init
  (setopt pdf-view-display-size 'fit-page
          pdf-view-resize-factor 1.1
          pdf-annot-activate-created-annotations t
          pdf-view-use-unicode-ligther nil
          )
)

;; Structure and Interpretation of Computer Programs as info file
(use-package sicp)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-reading.el ends here
#+end_src

*** Removed reading packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header_args: :eval no :tangle no :noweb no
:CUSTOM_ID: removed-reading-packages
:END:

#+begin_src emacs-lisp :eval no :tangle no :noweb no
(use-package wallabag
  :disabled
  :load-path "~/.emacs.d/lisp/wallabag/"
  :config
  (setq wallabag-host "https://xx.xx.xx")
  (setq wallabag-username "xx")
  (setq wallabag-password "xx")
  (setq wallabag-clientid "xx")
  (setq wallabag-secret "xx")
  (setq wallabag-search-print-items '("title" "domain" "tag" "reading-time" "date"))
(setq wallabag-search-page-max-rows 32)
  )

(use-package zotxt
	:disabled)

(use-package pocket-reader
	:disabled)

(use-package biblio
	:disabled)

(use-package arxiv-mode
	:disabled)

(use-package calibredb
	:disabled)

(use-package devdocs
	:general
	(tyrant-def
		"Jm" 'devdocs-lookup
		"JM" 'devdocs-peruse
		"hd" 'devdocs-peruse)
	)

(use-package dash-docs
	:disabled)

(use-package consult-dash
	:disabled
  :after (consult dash-docs)
	:general
	(tyrant-def
		"Jm" 'consult-dash)
  :config
   (consult-customize consult-dash :initial (thing-at-point 'symbol))
	)
#+end_src
** setup-ui.el
:PROPERTIES:
:CUSTOM_ID: setup-uiel
:LAST_MODIFIED: [2025-10-21 Tue 03:41]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-ui.el
;;; config/setup-ui.el --- UI configuration -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(use-package bicycle
  :hook ((prog-mode . outline-minor-mode)
         (prog-mode . hs-minor-mode))
  :general (tyrant-def
             "t TAB" 'bicycle-cycle
             "t <backtab>" 'bicycle-cycle-global
             )
  )

(use-package olivetti
  :hook ((text-mode prog-mode org-mode) . olivetti-mode)
  :config (setopt olivetti-style 'fancy
                  olivetti-body-width 0.7
                  olivetti-minimum-body-width 80
                  olivetti-recall-visual-line-mode-entry-state t
                  )
  )


(use-package shackle
  :config
  (setopt shackle-mode t
          shackle-default-size 0.25
          shackle-rules
          `((help-mode :select t :align right :size 0.4)
            (helpful-mode :select t :align right :size 0.4)
            (inferior-ess-r-mode :select t :alight right :size 0.5)
            (ess-r-info-mode :select t :align right :size 0.4)
            ("*Messages*"                    :select t :align t)
            ("*eldoc*"                       :align t)
            (special-mode                    :align t)
            (process-menu-mode               :align t)
            (compilation-mode                :align t)
            (flymake-diagnostics-buffer-mode :align t)
            ("*Shell Command Output*"        :align t :size 2)
            ("*Async Shell Command*"         :align t :size 2)
            (lsp-bridge-ref-mode             :align t :size 0.2)
            ("*elpaca-info*"                 :align t)
            )
          )
  )

(use-package spacious-padding
  :hook elpaca-after-init
  :config (setopt spacious-padding-subtle-frame-lines t
                  spacious-padding-widths '(:internal-border-width 10
                                            :header-line-width 4
                                            :mode-line-width 4
                                            :tab-width 4
                                            :right-divider-width 0
                                            :scroll-bar-width 4
                                            :fringe-width 8)
                  )
  )

(use-package popper
  :config
  (setopt popper-display-control nil
          popper-reference-buffers
          '("\*Messages\*"
            "Output\*$"
            "\*Async Shell Command\*"
            "\*eldoc\*"
            "^\*EGLOT"
            "^\*lsp-bridge.*"
            "\*lsp-bridge-ref\*"
            compilation-mode
            ess-r-help-mode
            help-mode
            helpful-mode
            process-menu-mode
            special-mode
            flymake-diagnostics-buffer-mode))
  :general
  (tyrant-def
    ";" '("pop toggle" . popper-toggle)
    ":" '("pop kill" . popper-kill-latest-popup))
  :custom
  (popper-mode 1)
  (popper-echo-mode 1)
  )

(use-package visual-fill-column
  :hook (elpaca-after-init . global-visual-fill-column-mode)
  :config (setopt visual-fill-column-center-text t
                  visual-fill-column-extra-text-width '(4 . 4)
                  fill-column 80
                  )
  (add-hook 'visual-line-mode-hook #'visual-fill-column-for-vline)
  )
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-ui.el ends here
#+end_src

*** Removed elements
:PROPERTIES:
:CUSTOM_ID: removed-elements
:END:

**** Focus mode type packages
:PROPERTIES:
:CUSTOM_ID: focus-mode-type-packages
:LAST_MODIFIED: [2025-07-25 Fri 01:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package logos
  :disabled
  )
(use-package focus
  :disabled
  :general
  (tyrant-def "tF" 'focus-mode)
  )
(use-package writeroom-mode
  :disabled
  :config
  (setq split-width-threshold 120
        writeroom-width 128
        writeroom-fringes-outside-margins nil
        writeroom-global-effects nil
        writeroom-major-modes-exceptions '(process-menu-mode proced-mode backtrace-mode)
        writeroom-maximize-window t
        writeroom-mode-line t
        writeroom-mode-line-toggle-position 'mode-line-format)
  :general
  (tyrant-def
    "wc" 'writeroom-mode
    "wC" 'global-writeroom-mode)
  )
#+end_src

**** Minibuffer
:PROPERTIES:
:CUSTOM_ID: minibuffer
:LAST_MODIFIED: [2025-07-25 Fri 01:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Minibuffer + completions in tandem
#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package mct
  :disabled
  :hook (vertico-mode . mct-mode)
  )
#+end_src
**** Window automatic sizing and window configuration management
:PROPERTIES:
:CUSTOM_ID: window-automatic-sizing-and-window-configuration-management
:LAST_MODIFIED: [2025-07-27 Sun 18:13]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

*Zoom*: Golden ratio hasn't been updated in a couple of years and zoom is a
replacement project maybe? Out of the box zoom really does not play nicely with
my existing configuration. Minibuffer taking half the screen when I go use a
command, overriding shackle, things like that. Would need to take time to
configure it to play nicely if I wanted to use it.

Activities seems to be more of a session manager + window manager
#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package golden-ratio
  :disabled
  :config (setopt golden-ratio-mode nil)
  )

(use-package zoom
  :disabled)


(use-package activities
  :disabled
  :init
  (activities-mode)
  (activities-tabs-mode)
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list)))

;; tiling-window-manager-eqsque window configuration management
(use-package eyebrowse
  :disabled)

(use-package sideline
  :hook (flymake-mode . sideline-mode)
  )
#+end_src

**** Programming focused UI changes
:PROPERTIES:
:CUSTOM_ID: programming-focused-ui-changes
:LAST_MODIFIED: [2025-07-25 Fri 02:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package indent-control
  :disabled)

(use-package nocomments-mode
  :disabled
  :general (tyrant-def "tc" 'nocomments-mode)
  )

(use-package sideline-flymake
    :init
    (setq sideline-backends-right '(sideline-flymake))
    (add-hook 'flymake-mode-hook
              (lambda () (remove-hook 'eldoc-documentation-functions 'flymake-eldoc-function t))
              )
    )
#+end_src

**** Probably theming not UI
:PROPERTIES:
:CUSTOM_ID: probably-theming-not-ui
:LAST_MODIFIED: [2025-07-25 Fri 01:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Use SF Symbols instead of the default Emacs image toolbar. Would require me to
use the toolbar in the first place.  
#+begin_src emacs-lisp :tangle no :comments no :eval no
(use-package calle24
  :disabled
  :hook (compilation-mode . calle24-refresh-appearance)
  :config
  (calle24-refresh-appearance)
  )
#+end_src
